["Yahoo News - Latest News & Headlines", [{"Title": "Did Democrats just help Trump win reelection?", "Date": "2019-12-12 11:05:47-05:00", "Link": "https://news.yahoo.com/did-democrats-just-help-trump-win-reelection-160547285.html", "Description": "House Democrats have officially agreed to back a revised version of Trump’s new trade pact ­— an announcement made just one hour after House Democratic leaders unveiled articles of impeachment against him."}, {"Title": "Britain’s Political Map Changes Color in Ways Few Could Imagine", "Date": "2019-12-13 02:24:07-05:00", "Link": "https://news.yahoo.com/britain-political-map-changes-color-072407501.html", "Description": "(Bloomberg) -- Sign up to our Brexit Bulletin, follow us @Brexit and subscribe to our podcast.Towns in northern England share a history of mining, faded industry and neglect. For generations they also had another thing in common: staunch support for the Labour Party.From Workington on the west coast to Bishop Auckland and Blyth on the east, the dominoes fell as the results from the U.K. election rolled in through the small hours of Friday morning. The U.K.’s tortured efforts to leave the European Union redefined political tribes as Prime Minister Boris Johnson’s Conservatives took seats his party has never held before.Johnson declared the victory as “historic.” That will be even more apparent in places where most voters have never known a Conservative lawmaker.Workington, where mines and steelworks shut years ago, last voted Conservative in 1976. Back then Britain was in the grip of an economic crisis. It turned back to the red of Labour three years later. On Thursday it voted Conservative by a margin of 10 percentage points.Bishop Auckland, in the mining area south of Newcastle, had never turned Tory blue in more than a century. Elsewhere, Bassetlaw in Nottinghamshire elected a Conservative for the first time since the 1930s, as did swathes of the Midlands and Yorkshire. Labour’s so-called “Red Wall” had fallen.Many of these former mining and steel towns endured mass unemployment under the Conservative governments of the 1980s. They then voted for Brexit in the 2016 referendum amid a wave of anger at austerity, frustration over immigration and dismay at joblessness and lack of opportunity. Today, they are embracing the Tories in their determination to finally quit the EU. Backing for Brexit also comes with a rejection of the socialist promises of Labour leader Jeremy Corbyn, who now says he will step down.In Scotland, Labour’s vote had already collapsed in the wake of the independence referendum in 2014. This time around the pro-independence Scottish National Party took the vast majority of districts again, even in some of the post-industrial regions that Labour had won back in 2017.In that election, the Conservatives planted a giant poster on a dilapidated building near the seafront in Redcar, a town in England’s northeast haunted by steelworks that finally collapsed a few years ago. The Tories had never won in Redcar, and failed in 2017 as well. But as people demanded their voice be heard over Brexit, the voters of Redcar did in 2019 as so many did across the north of England: They abandoned Labour -- and embraced Boris Johnson.To contact the reporter on this story: Rodney Jefferson in Edinburgh at r.jefferson@bloomberg.netTo contact the editors responsible for this story: Heather Harris at hharris5@bloomberg.net, Adam Blenford, Alan CrawfordFor more articles like this, please visit us at bloomberg.com©2019 Bloomberg L.P."}]]