[
    "Yahoo News - Latest News & Headlines",
    [
        {
            "Title": "GOP lawmaker says 'out-of-the-box strategy' could give Trump an 'advantage' in impeachment hearings",
            "Date": "Sun, 08 Dec 2019 12:28:50 -0500",
            "Link": "https://news.yahoo.com/gop-lawmaker-says-outofthebox-strategy-could-give-trump-an-advantage-in-impeachment-hearings-172850668.html",
            "Description": "Rep. Matt Gaetz said it would play to the “president’s advantage” to have his top administration officials testify in the upcoming impeachment hearings."
        },
        {
            "Title": "Serial rapist given 33 life sentences after UK rampage while wrongly free",
            "Date": "Mon, 09 Dec 2019 10:55:27 -0500",
            "Link": "https://news.yahoo.com/serial-rapist-given-33-life-155527846.html",
            "Description": "A convicted burglar who assaulted and raped women and children during a two-week rampage across Britain while wrongly free from jail was given 33 life sentences on Monday, with the judge saying he would never cease to be a danger to society. Joseph McCann, 34, was convicted of 37 offences relating to 11 victims aged between 11 and 71, committed in April and May this year. Sentencing him at London's Old Bailey Court, judge Andrew Edis said he was \"a coward, a violent bully and a paedophile\"."
        },
        {
            "Title": "This Pictures Proves 1 Fact: It's Really Hard to Sink a U.S. Navy Submarine",
            "Date": "Mon, 09 Dec 2019 03:05:00 -0500",
            "Link": "https://news.yahoo.com/pictures-proves-1-fact-really-080500371.html",
            "Description": "And thank god for that."
        },
        {
            "Title": "The 25 Best Tower Defense Games",
            "Date": "Sun, 08 Dec 2019 09:00:00 -0500",
            "Link": "https://news.yahoo.com/25-best-tower-defense-games-140000068.html",
            "Description": ""
        },
        {
            "Title": "U.S. military to shift focus to competing with China and Russia: Esper",
            "Date": "Mon, 09 Dec 2019 09:37:17 -0500",
            "Link": "https://news.yahoo.com/u-military-shift-focus-competing-143717084.html",
            "Description": "Defense Secretary Mark Esper said Saturday he still plans to shift the military’s focus to competing with China and Russia, even as security threats pile up in the Middle East. Esper outlined his strategic goals and priorities in a speech at the Reagan National Defense Forum, an annual gathering of government, defense industry and military officials."
        },
        {
            "Title": "Plot Emerged to Fix Venezuela Without Maduro or Guaido",
            "Date": "Sun, 08 Dec 2019 07:47:13 -0500",
            "Link": "https://news.yahoo.com/plot-emerged-fix-venezuela-without-124713461.html",
            "Description": "(Bloomberg) -- The standoff in Venezuela briefly took a new twist, according to a report from the Spanish newspaper ABC.People close to both President Nicolas Maduro and his rival Juan Guaido plotted to push both men aside and end the nation’s crisis with the rule of a temporary junta, the newspaper reported without citing where it got the information.The article didn’t cite sources by name, nor was it completely clear how deeply embedded the plan was before it was discovered and fell apart. But the story suggests a strong desire within the camps of both men to end the standoff between Maduro and Guaido almost a year old. Guaido, the National Assembly president, has been recognized by more than 50 countries, including the U.S., as Venezuela’s leader.Third WayThe ABC story suggested a third way, which the paper reported was born out of talks between emissaries of high-ranking Venezuelan officials with opposition leaders, in four countries between April and October this year, after huge rallies demanding Maduro’s exit.The key figure appears to be Humberto Calderon Berti, then the designated ambassador to Colombia who Guaido dismissed last month. He was the main Guaido negotiator in the talks with the emissaries for Venezuelan officials who defied Maduro.At some point in the talks, the paper said, Calderon Berti was approached to head a “transitional junta” -- a small group of powerful men who would lead the nation for 18 months. The paper said that an agreement was drafted by August, with the document outlining the political changes to oust Maduro, sideline Guaido and install the junta sent around to the key players.The Venezuelan officials who sent emissaries for the secret talks included president of the National Constituent Assembly Diosdado Cabello, one of Venezuela’s most powerful men with strong ties to the military, Supreme Court President Maikel Moreno and Defense Minister Vladimir Padrino.The negotiations were complex, involving the reconciliation of various factions within the army and voiding the May 2018 presidential elections Maduro is widely seen as winning only by fraud.Temporary JuntaThe paper cites discussions in which a Cabello emissary, army captain Carlos Aguilera Borjas, suggests that Calderon Berti head the temporary junta. The paper says that Maduro’s regime discovered the talks, which then came to an end.Calderon Berti told ABC newspaper that he met with Aguilera Borjas and others. But these meetings were part of his diplomatic duties and had nothing to do with a plot to form a junta, Calderon Berti said.Guaido’s representatives declined to comment on the ABC report, while the Maduro government didn’t respond to requests to do so.To contact the reporter on this story: Jose Orozco in Mexico City at jorozco8@bloomberg.netTo contact the editors responsible for this story: Ney Hayashi at ncruz4@bloomberg.net, Ian Fisher, Matthew G. MillerFor more articles like this, please visit us at bloomberg.com©2019 Bloomberg L.P."
        },
        {
            "Title": "It’s Not Because She’s a Woman",
            "Date": "Mon, 09 Dec 2019 06:30:47 -0500",
            "Link": "https://news.yahoo.com/sexism-isn-t-why-warren-113047631.html",
            "Description": "In early October, Elizabeth Warren hit her stride. Her stock in the Democratic primary had been climbing steadily since midsummer, and as Joe Biden continued to lag, the Massachusetts senator became the first presidential hopeful to overtake him as front-runner in the RealClearPolitics polling average.She’s been in free fall ever since.Warren now sits at just 14.8 percent in the RCP average, in third place behind Bernie Sanders, with about half the support Biden has. The former vice president has lost a step or two (or several) since his time as Obama’s right-hand man, but it’s looking less and less likely that Warren will be the Democrat to supplant him as the party’s favorite heading into 2020’s early primaries.For media observers who have been pulling for Warren from the start of her campaign, there can be only one plausible explanation for her fall from grace: sexism.On November 10, after Biden attacked Warren’s Medicare for All plan and her campaign shot back, saying the former vice president was using GOP talking points against her, Biden released a statement saying Warren’s response was reflective of an “angry unyielding viewpoint.” Warren’s defenders have latched on to the phrase as evidence that Biden — along with voters who have declined to back Warren — is guilty of sexism.“The Sexism Is Getting Sneakier” was the headline of one article in the Atlantic on the subject, in which the author mused:> Anger, rendered as a criticism . . . is a targeted missile, seeking the spaces in the American mind that still assume there is something unseemly about an angry woman. It is attempting to tap into the dark and ugly history in which the anger displayed by a woman is assumed to compromise her—to render her unattractive precisely because the anger makes her uncontrollable.The Washington Post’s analysis of the incident ran under the headline “Is Elizabeth Warren ‘angry’ and antagonistic? Or are rivals dabbling in gendered criticism?” The authors suggested that charges against Warren “get at something far beyond her policy positions, and into one of the most fraught areas for a female candidate: Is she likable?”The New York Times report noted that “by calling Warren’s approach ‘condescending,’ ‘angry’ and elitist, Biden and his allies are making a risky case against a female candidate.” An opinion article in Essence magazine put it much more bluntly: “Only Sexist Men Take Issue with Elizabeth Warren’s Justified Anger.”Though Warren brushed off questions about Biden’s use of “angry,” she seems more than willing to use rhetoric about sexism to her advantage. When Kamala Harris exited the race in early December, Warren’s campaign took the occasion to send a fundraising email reading, “Kamala Harris and Kirsten Gillibrand — two women senators who, together, won more than 11.5 million votes in their last elections — have been forced out of this race, while billionaires Tom Steyer and Michael Bloomberg have been allowed to buy their way in.”It turns out that Warren supporters were laying the groundwork to defend her with an argument about pervasive sexism even before her rise and fall. “‘A Woman, Just Not That Woman’: How Sexism Plays Out on the Trail” was the headline of a Times piece in February. “Reluctance to support female candidates is apparent in the language that voters frequently use to describe men and women running for office; in the qualities that voters say they seek; and in the perceived flaws that voters say they are willing or unwilling to overlook in candidates,” the author asserted.“Elizabeth Warren, Hillary Clinton and the sexist hypocrisy of the ‘likability’ media narrative. Here we go again” was the contribution from an NBC News opinion article, which claimed that only female candidates are subjected to criticism of their appearance and tone. In September, a Democratic strategist said that supporting Sanders over Warren is “showing your sexism.”But if sexism really were to blame, why would Warren have spent several months as the race’s second front-runner, in close contention with Biden? What few on the left appear to have considered is the possibility that Warren’s policy positions and recent blunders bear the most responsibility for her declining popularity.Over the last several months, Warren has stumbled — and not because voters discovered she’s a woman.There was this report puncturing her narrative about having faced pregnancy discrimination. There was her false response to a question about whether her children had ever attended private school. And there was her repeated refusal, during the last debate before her Medicare for All rollout, to say whether her plan would raise taxes on the middle class, along with her subsequent falsehood that it would not.But the best explanation for Warren’s decline is her Medicare for All plan itself, and her drop in the polls is clearly correlated with its rollout. As recently as October 22, Warren trailed Biden in the RCP average by about four points. The week following her Medicare for All debut, she had dropped nearly ten points behind him. By mid November, she had fallen into third place behind Sanders, and she hasn’t recovered her second-place standing since.Finally, if sexism were responsible for the bulk of Warren’s woes, the polling data would make little sense. In the most recent Quinnipiac poll, for example, 23 percent of women said they preferred Biden, while 16 percent favored Warren. A recent poll from The Hill/HarrisX found a similar situation: Thirty-three percent of female respondents chose Biden, 16 percent chose Sanders, and only 10 percent chose Warren.To claim that Warren’s collapse is the result of sexism, her defenders would have to excuse her obvious missteps and insist that women fail to embrace female candidates due to “internalized misogyny.” And, of course, they’re all too happy to do just that."
        },
        {
            "Title": "The 2 US Navy sailors being hailed as heroes in the Pensacola shooting were fresh out of military training",
            "Date": "Sat, 07 Dec 2019 22:36:07 -0500",
            "Link": "https://news.yahoo.com/2-us-navy-sailors-being-033607177.html",
            "Description": "Another victim from a previous shooting in Florida bore some semblance to the reported victims of the recent Naval Air Station shooting."
        },
        {
            "Title": "Body of slain doctor returns home to Japan from Afghanistan",
            "Date": "Sun, 08 Dec 2019 04:26:03 -0500",
            "Link": "https://news.yahoo.com/body-slain-doctor-returns-home-092603705.html",
            "Description": "The body of a Japanese doctor killed in a roadside shooting in Afghanistan arrived back home Sunday, with government officials on hand to lead a brief ceremony of mourning at Tokyo's Narita International Airport. Tetsu Nakamura was killed last week, along with five Afghans who had been traveling with him. Keisuke Suzuki, Japan's state minister of foreign affairs, joined other officials in bowing their heads in prayer after laying flowers by the coffin, draped in white, in a solemn ceremony in honor of Nakamura at the airport."
        },
        {
            "Title": "Meet the lawyer at the center of the Trump universe",
            "Date": "Sun, 08 Dec 2019 13:35:00 -0500",
            "Link": "https://news.yahoo.com/marc-mukasey-lawyer-trump-universe-183500453.html",
            "Description": "Marc Mukasey has deep, personal connections within President Trump’s orbit, and he has worked on a number of high-profile cases involving the president."
        },
        {
            "Title": "U.S. Supreme Court rejects Arizona opioid case against Purdue, Sackler family",
            "Date": "Mon, 09 Dec 2019 09:51:38 -0500",
            "Link": "https://news.yahoo.com/u-supreme-court-rejects-arizona-145138268.html",
            "Description": "The U.S. Supreme Court on Monday turned away a novel case by Arizona seeking to recover billions of dollars that the state has said that members of the Sackler family - owners of Purdue Pharma LP - funneled out of the OxyContin maker before the company filed for bankruptcy in September. The justices declined to take the rare step of allowing Arizona Attorney General Mark Brnovich to pursue a case directly with the Supreme Court on the role the drugmaker played in the U.S. opioid epidemic that has killed tens of thousands of Americans annually in recent years. The lawsuit accused eight Sackler family members of funneling $4 billion out of Purdue from 2008 to 2016 despite being aware that the company faced massive potential liabilities over its marketing of opioid medications."
        },
        {
            "Title": "Katie Hill: It's Not Over After All",
            "Date": "Sun, 08 Dec 2019 11:55:40 -0500",
            "Link": "https://news.yahoo.com/katie-hill-not-over-164952449.html",
            "Description": "I OVERCAME THE DESPERATION I FELT AFTER STEPPING DOWN FROM CONGRESS, AND I'M STILL IN THE FIGHT.On Nov. 6, 2018, I was elected to Congress; at 31, I was one of the youngest women ever elected to the House of Representatives. One year later, I was sitting on a train to New York to meet with my lawyers about suing The Daily Mail for cyber exploitation -- and I was no longer a member of Congress.A few days earlier, on Oct. 31, 2019, I stepped up to the microphone to deliver my final speech on the house floor. It was the first time I had spoken publicly since my relationship with a campaign staffer was exposed, since naked photos of me -- taken without my knowledge and distributed without my consent -- had been posted online, since wild accusations from my estranged husband about a supposed affair with a congressional staffer (which I have repeatedly denied), since I had resigned my hard-fought seat in Congress. I had barely gotten used to giving such speeches. Over the past year I had awkwardly learned, with many fumbles, how to perform the ritual that so many had done before me: formally ask the speaker of the House for recognition, walk to the lectern and smoothly position it to the correct height, adjust the microphone so it isn't blocking your face and look at the clock so the C-Span cameras can see you. Talk slowly and fluidly. Breathe; the pauses you take feel much longer than they are.That day, oddly, I didn't get nervous the way I normally did. I got every part of the routine right. I felt calm and strong as I began to speak, because I had to be. I needed to say something to the countless people who had put their faith in me. I needed to say something to the girls and young women who looked up to me, and also to those who didn't even know my name. I needed to make sure that my horrific experience did not frighten and discourage other women who will dare to take risks, dare to step into this light, dare to be powerful.Many people have nightmares in which they're naked in public, trapped and trying to escape. In the days leading up to my resignation, my life was just like everyone's worst nightmare. Millions of people had seen pictures of me naked. Hundreds of journalists, commentators, politicians and public figures had written or spoken about my \"downfall,\" the \"choices\" I made, the lessons young people should take from what happened to me, the impact it would have on politics moving forward, the responsibility I bore for all of it.I read those articles with the acute sense that writers and readers alike must think I am already dead. I'm not, though sometimes I've wished to be. More than half of the victims of cyber exploitation (also known as revenge porn) contemplate suicide in the aftermath. Many have attempted, and some tragically have succeeded.After the images came out, as I lay curled up in my bed with my mind in the darkest places it's ever been, countless texts and voice mails came from donors, friends, volunteers and voters sending love. But they couldn't drown out the horrible messages and calls from people who found my phone number on the internet.Though staff members at my (now former) offices got tremendous support, they were also inundated with lewd and threatening messages. When a letter filled with suspicious powder arrived at one of my offices, staffers had to be evacuated. My hometown was filled with people who were worried about me, cared about me and wanted to see me, and yet my mom was followed by people in dark trucks with cameras, my sister's business was trolled and my dad drove around our hometown pulling down huge posters of his baby girl in a Nazi uniform with the text \"WifenSwappenSS.\"Sitting on that train to New York a few days after my resignation had taken effect, reflecting on what my life had become, I realized that it was almost one year to the minute from when I received a voice mail from my predecessor, Steve Knight, to concede -- when I found out I was going to be a congresswoman.I was in the campaign headquarters the morning he called. The team had been working around the clock for months or longer -- some people had been with the campaign for over a year -- as we clawed our way to victory in a race that no one thought we could win. When I announced my candidacy, I was 29 years old, working at a homeless services nonprofit organization and had been driven to run for office because of the results of the 2016 presidential election. I was a complete unknown, a young bisexual woman with no political background or experience, no wealth, no Ivy League degree, trying to flip a district that had been held by Republicans for over two decades.When I finished listening to the voice mail from my opponent, I turned around and told my team. Countless people across the country have witnessed that moment -- Vice captured it as part of a documentary series called \"She's Running.\" Most people on my team cried, but I didn't. I couldn't really tell you how I felt then. Shock isn't quite right -- I had felt like we'd win for a long time -- though it certainly felt surreal.I was aware that my life was about to change substantially, but it had already changed so much that I felt like I was just shifting gears. I was excited. I felt ready for it. I knew I was a leader, that I represented my community, that I reflected the change that the country wanted and needed. I knew that I could be a voice for young people and women and people who had been left out for far too long. That I had to be.Once I got to Washington, I was one of two people elected to represent the freshman class at the leadership table, and once I started sitting in meetings multiple times each week with Speaker Nancy Pelosi and the other most powerful Democrats in the House, I knew I belonged there, too. I didn't feel awkward or unsure. I was completely confident. I felt like my district loved me (and the polling showed it) and I knew I was making a difference to so many people even just by showing them they could have a voice at the highest levels of power.The job was hard -- I made some missteps, there were plenty of things I could have done better, and I had so much to learn. But I was figuring it out fast. I was good at this. My future in Congress was limitless, and that mattered not only to me but to the people who believed in me.My home life was another story. That day on the train to New York was also five months to the day from when I moved out of my house and told my husband, who I had been with since I was 16 years old, that I wanted a divorce. It wasn't the first time I had tried to leave; the last time was less than a month before the election, and when I tried, he made it clear to me that if I left, he would ruin me. I knew he could, so I went back to him and finished the campaign. But, after five months on the job and with the toxicity of our relationship growing worse, I knew I had to finally leave once and for all.In June, my dad came with me to my house. I got my things, moved in with my mom, and didn't look back. The fear that my husband would ruin me hung over me every day. I knew the risk when I left, but I thought I didn't have a choice, and despite the threat, I felt better than I had in years.The day that my communications director ran into my office and showed me the nudes and private text messages that had been published on a right-wing website called Red State, everything came crashing down. I believe my husband is the source of the images. (He has reportedly denied this; his father said in an interview that his son believed he had been hacked. My husband and his lawyer did not respond to requests from the Times for comment.) At first, I was in denial. I couldn't accept that the future I had imagined as a leader in Congress -- the job I loved and knew I was making a difference by being in -- was over.I was thinking about all of this as I went to see my lawyers. Suddenly, the train stopped. We sat there for a long time, wondering what had happened. Then someone announced that a person had jumped in front of the train, and died. My thoughts shifted to the person on the tracks while we waited for the police to investigate and for the coroner to arrive. I knew the despair that can lead someone to that place all too well. I had been there just a week before.People have speculated that Speaker Pelosi or the party leadership asked me to resign because of the photos and the allegations about me. That could not be further from the truth. In fact, one of the most difficult moments during my resignation process was my phone call to the Speaker, a woman I admire more than anyone and who I had come to love. She told me I didn't have to do this, that the country needed me and that she wished I hadn't made this decision, but she respected me and what I felt I needed to do. I told her what I told everyone else when I announced my resignation: that it was the right thing to do.I knew it was the best decision for me, my family, my staff, my colleagues, my community. But that didn't make it any easier, and in the days that followed, I was overwhelmed by everything -- by how many people had seen my naked body, by the comments, the articles, the millions of opinions, the texts, the calls. I would start shaking, crying, throwing up. It was hard to talk to my family because I knew they were going through so much, too. I didn't want to talk to my friends because I was humiliated and didn't want to hear more pity and didn't know what to say. Many of my staff members had been with me for years, and we were, for better or worse, very close; now I feared that they all hated me.I didn't leave my apartment. I felt so alone and didn't know what to do.It was two days after I announced my resignation. I don't even know how I spent the day. I was probably reading articles about myself that I shouldn't have been reading, ignoring more text messages and calls, falling in and out of restless sleep. But when it got dark I drew a bath, lit candles and brought over a bottle of wine.I laid there and thought about what I'd lost. The people on my team and in my life who had been hurt and had done nothing wrong. Everyone I'd let down, everyone who worked for me, who campaigned for me, who believed in me. The future I thought was in store for me that was instantly and irrevocably gone. My own mistakes had led me there, but there were other things at play. And those pictures -- no one should have ever seen them.How could I ever face anyone again knowing what they'd seen? Knowing what they knew?The bath water had gone cold. The wine bottle was empty. Suddenly and with total clarity, I just wanted it all to be over. I got up and looked for the box cutter. I couldn't find it. A part of my brain was saying: \"Stop it, this is stupid. You're not going to do it. Go drain the bathtub and get yourself together.\" But I felt like I was out of my body, like it was moving without me, and I got the paring knife and got back into the cold bath.I stared at the veins in my wrists. They were so thin. They were green in the candlelight. I started tracing them with the edge of the knife, lightly at first, then pushing harder and harder. The knife was duller than I thought. It surprised me how hard I had to push simply to scratch the surface. Fine red lines started to appear, and I knew that if I pushed just a tiny bit harder I would start to bleed. I thought about the people I had already let down so much. What would this do to my parents? To my brother and sister?And then I thought about my supporters. I thought about the high school students who had told me how I inspired them. I thought about the Girl Scouts whose troops I'd visited who told me they wanted to grow up to be like me, and how their parents would explain this to them, and what it would do to them. And I realized I couldn't do it. I ran the campaign knowing it was bigger than me and what I wanted, and it still is. I don't get to quit. I have to keep going forward, and be part of the fight to create the change that those young girls are counting on.The next day, I wrote my final speech. My roommate, Lauren Underwood, the youngest black woman ever elected to Congress and my best friend in Washington, gave me a goodbye party with my freshman colleagues. I spent the evening with history-makers, change-makers, majority-makers, role models and heroes to millions. Some great men, but mostly women. Women who will be remembered forever. But that night, they were just my friends.At the end of the evening, I sat uncomfortably on a bar stool and cried as my friends went around the room and said the nicest things -- things I needed to hear. Each and every one of them told me that I wasn't done. Alex -- \"A.O.C.,\" as people like to call her -- said I was a warrior and always would be.So the next day I put on my battle uniform: a red dress suit that my mom had bought me. I put on my war paint: bright red lipstick. I stepped up to that lectern and told the world that although my time in Congress was over, I wasn't done -- I was just moving to another battlefield. I closed my speech, saying: \"We will not stand down. We will not be broken. We will not be silenced. We will rise, and we will make tomorrow better than today. … I yield the balance of my time for now, but not forever.\" I meant that not just for myself, but for all of us.I don't know exactly what's ahead for me, and I know there's a lot more pain ahead. But I'm in the fight, and I'm glad it's not all over after all.This article originally appeared in The New York Times.(C) 2019 The New York Times Company"
        },
        {
            "Title": "'An outright lie': Ohio lawmaker shown to be linked to group pushing rightwing Christian bills",
            "Date": "Mon, 09 Dec 2019 05:00:05 -0500",
            "Link": "https://news.yahoo.com/ohio-legislator-linked-rightwing-bill-100005728.html",
            "Description": "Timothy Ginter, who said he had ‘no knowledge’ of Project Blitz, was listed as co-chair of state branch of group behind the campaignAn Ohio legislator who said he had “no knowledge” of a rightwing Christian bill mill called Project Blitz is, in fact, the co-chair of the state branch of an organization behind the campaign.The Ohio state representative Timothy Ginter sponsored a bill called the Student Religious Liberties Act. Opponents argued the bill would provide students with a religious exemption to facts, and would frighten teachers and school administrators into including religion in school functions.The Guardian revealed the bill was nearly identical to one promoted by Project Blitz, a state legislative project guided by three Christian right organizations, including the Congressional Prayer Caucus (CPC), WallBuilders and the ProFamily Legislators Conference. Project Blitz aims to promote and help pass conservative legislation across the US to fulfil its rightwing Christian agenda.When initially approached, Ginter told the Guardian in an email from a legislative aide that he had “no knowledge of ‘Project Blitz’ and has not been working with WallBuilders or the Congressional Prayer Caucus”.However, a screenshot shows Ginter was listed as the co-chair of the Ohio Prayer Caucus, the state chapter of the Congressional Prayer Caucus, as recently as January 2019. Ginter’s former chief of staff, Chris Albanese, is currently listed as the state director of the state chapter of CPC, Ohio Prayer Caucus.“I would call it an outright lie,” said Frederick Clarkson, a senior research analyst with Political Research Associates, and an expert on the Christian right. “The Prayer Caucus in the states are the action arm of Project Blitz – it is Project Blitz,” he said. “When he told you, ‘I’ve never heard of Project Blitz,’ that was a lie,” said Clarkson.The Guardian repeatedly called and emailed both Ginter and the the Republican Ohio house speaker, Larry Householder. Neither responded to these phone or email requests.In a statement at the time, Ginter argued the bill was necessary because, “well-funded groups” were intimidating school officials with “the thread of litigation”. His bill, he argued, would clarify their responsibilities.Ginter also argued the Student Religious Liberties Bill was not a Christian bill, because it does not explicitly mention Christianity. However, the Ohio Prayer Caucus he co-chaired explicitly lays out that it support legislators “who are standing for faith, morality and Judeo-Christian principles”.The Congressional Prayer Caucus also circulated an Ohio Prayer Proclamation. Among its signers are Ginter; the former representative Bill Hayes, who originally sponsored the bill; and the former House speaker Cliff Rosenberger. Rosenberger resigned in 2018 after a search warrant and subpoena revealed the FBI was investigating Rosenberger for corruption involving three payday lending representatives, according to the Dayton Daily News.Prominent defenders of religious liberties, including the American Civil Liberties Union and the Anti-Defamation League, oppose the legislation. Republicans in the Ohio House passed the legislation with a party-line vote in November. It has not yet been taken up by the Ohio senate."
        },
        {
            "Title": "Millions Dead: You Won't Believe the True Horror of the Korean War",
            "Date": "Sat, 07 Dec 2019 23:30:00 -0500",
            "Link": "https://news.yahoo.com/millions-dead-wont-believe-true-043000001.html",
            "Description": "Too often the conflict, and the people who fought it, are forgotten."
        },
        {
            "Title": "Ramaphosa Faces Party Bid to Oust Him Over Reforms, Citizen Says",
            "Date": "Mon, 09 Dec 2019 02:39:04 -0500",
            "Link": "https://news.yahoo.com/ramaphosa-faces-party-bid-oust-073904100.html",
            "Description": "(Bloomberg) -- South African President Cyril Ramaphosa’s opponents within the ruling party are plotting to oust him over reforms that they say are failing to benefit the poor, the Citizen reported, citing people it didn’t identify.A campaign being led by African National Congress Secretary-General Ace Magashule aims to discredit him over economic policies that his opponents argue are supplanting the party’s pro-poor stance, the Johannesburg-based newspaper said.The anti-Ramaphosa faction wants Deputy President David Mabuza to become president, deputized by either Magashule or Water Minister Lindiwe Sisulu, the newspaper said.ANC spokesman Pule Mabe didn’t answer calls to his mobile seeking comment.Magashule is an ally of former President Jacob Zuma, whose almost nine-year term was marred by a series of corruption scandals.To contact the reporter on this story: Paul Richardson in Johannesburg at pmrichardson@bloomberg.netTo contact the editors responsible for this story: Benjamin Harvey at bharvey11@bloomberg.net, Vernon Wessels, Alastair ReedFor more articles like this, please visit us at bloomberg.com©2019 Bloomberg L.P."
        },
        {
            "Title": "Barr Slams FBI for Surveilling Trump Campaign Based on ‘Thinnest of Suspicions’ In Response to IG Report",
            "Date": "Mon, 09 Dec 2019 13:54:25 -0500",
            "Link": "https://news.yahoo.com/barr-slams-fbi-surveilling-trump-185425887.html",
            "Description": "Attorney General William Barr slammed the FBI on Monday after the release of the Inspector General report detailing the agency's investigation of the Trump campaign's alleged ties with Russia.\"The Inspector General’s report now makes clear that the FBI launched an intrusive investigation of a U.S. presidential campaign on the thinnest of suspicions that, in my view, were insufficient to justify the steps taken,\" Barr said in a statement. \"It is also clear that, from its inception, the evidence produced by the investigation was consistently exculpatory.\"The FBI began its investigation after campaign staffer George Papadopoulos allegedly told a member of Australian intelligence that the campaign had obtained dirt on rival Hillary Clinton from Russian operatives.The agency then obtained a FISA warrant to surveil Trump campaign adviser Carter Page based largely on unverified intelligence gathered by former British operative Christopher Steele, but neglected to share with the FISA court the fact that Steele gathered the information as a contractor for the Hillary Clinton campaign.\"We concluded that the failures described above and in this report represent serious performance failures by the supervisory and non-supervisory agents with responsibility over the FISA applications,\" Inspector General Michael Horowitz wrote in the report.\"While most of the misconduct identified by the Inspector General was committed in 2016 and 2017 by a small group of now-former FBI officials, the malfeasance and misfeasance detailed in the Inspector General’s report reflects a clear abuse of the FISA process,\" Barr said in his statement.Horowitz concluded that the FBI did possess the legal basis to open an investigation into the Trump campaign, although the agency subsequently mishandled the probe with its applications for FISA warrants.However, U.S. Attorney John Durham, who is running a separate investigation under Barr's authority into the FBI probe of the Trump campaign, said in a statement Monday that he disagreed with that finding.\"Based on the evidence collected to date…last month we advised the IG that we do not agree with some of the report’s conclusions as to predication and how the FBI case was opened,\" Durham wrote."
        },
        {
            "Title": "Isil 'matchmaker' who lured British teen bride to Syria is deported to France",
            "Date": "Mon, 09 Dec 2019 11:51:01 -0500",
            "Link": "https://news.yahoo.com/isil-matchmaker-lured-british-teen-165101119.html",
            "Description": "Turkey has deported to France the “Islamic State matchmaker” who lured a British teen bride to Syria as part of a drive to send foreign fighters back to their countries of origin. Tooba Gondal, 25, is among 11 French nationals that Turkey repatriated early on Monday, according to France's Centre for Analysis of Terrorism, CAT, citing official sources. A French judicial source confirmed that four women and their seven children had arrived in France. Two of the women returned were already targeted by arrest warrants and will soon face a judge, while the other two were sought by police and have been placed in custody, the French source said.  The children have been taken into care. Ms Gondal, from Walthamstow, east London, has been \"detained for questioning\" and faces terror charges, said CAT. She will then likely be detained while awaiting trial. She was born in France but moved to UK capital as a child and had British residency. A source close to the family told The Telegraph they were upset by the UK's decision to refuse her return. \"Her kids most certainly will go into foster care away from her and any of her family in Britain,” said the source. Tooba Gondal, known as the 'Islamic State matchmaker' pictured before leaving for Syria in 2015 Ms Gondal has been accused of acting as an online recruiter and “matchmaker” for the terrorist group by luring women to Syria to marry Isil fighters. Among them was reportedly Bethnal Green schoolgirl Shamima Begum. She used social media to post images of herself wearing a burqa and holding an assault rifle. In October, Ms Gondal told the Telegraph how she managed to escape from Ain Issa camp with her two infant children, along with hundreds of other foreign suspected Isil women in a mass prison break after Turkey launched its offensive. She expressed a desire to be sent to the UK or Turkey. “I want to go home, see my family,” the former Goldsmiths, University of London, student said via WhatsApp messages. “But if I am not able, I want to seek refuge in Turkey.\" Married and widowed three times while living in Isil’s “caliphate”, she was banned from re-entering the UK last November by a Home Office exclusion order, but her three-year-old son is entitled to citizenship because of his British father. However, her 18-month-old daughter's late father was Russian. Last month, Turkey stepped up the return of suspected foreign Isil members - either held in Turkish prisons or in Syria - back to their countries of origin, saying Turkey was \"not a hotel\" for foreign fighters. The Turkish interior ministry on Monday confirmed it had sent 11 French relatives of suspected \"terrorist fighters\" back home. According to CAT, one of the deported women was Amandine Le Coz, who had been married to a Moroccan militant killed in Syria. She joined Isil with her husband in 2014. The French foreign ministry and interior ministry declined to comment. The mother-of-two, seen here with a Kalashnikov, was denied return to the United Kingdom with her children Credit: Telegraph Turkey stepped up its deportation of foreign fighters after criticism from Western countries, in particular, France, over its military offensive against Kurdish forces in Syria. The move has created a conundrum for European governments over how to manage the return of radicalised militants, some of them battle-hardened. Britain, which has taken one of the strongest stances against the return of its nationals, has deprived many of them of their citizenship. Under a 2014 accord between France and Turkey, Paris agreed to take back jihadists trying to return home from Syria via Turkey and incarcerate them at home. Some 300 French nationals have been thus returned in the past five years. However, France is keen on foreign suspects being sent for trial near to their place of arrest - notably Iraq, where several of its nationals have recently been handed death sentences. America last month clashed with Europe over the issue, with Mike Pompeo, US secretary of state, insisting they needed to “hold them to account”. \"Coalition members must take back the thousands of foreign terrorist fighters in custody and impose accountability for the atrocities they have perpetrated,\" he said in a meeting of the international coalition against Isil in Washington DC. Ankara says it has around 1,200 foreign Isil members in custody. There are understood to be around 10 British men, 20 women and 30 children, currently detained in Kurdish-run camps and prisons around north-east Syria."
        },
        {
            "Title": "One of the world's largest basic-income trials, a 2-year program in Finland, was a major flop. But experts say the test was flawed.",
            "Date": "Sun, 08 Dec 2019 08:51:00 -0500",
            "Link": "https://news.yahoo.com/one-worlds-largest-basic-income-135100540.html",
            "Description": "Two years after Finland launched a basic-income trial for unemployed residents, many of the recipients remained jobless."
        },
        {
            "Title": "Accidental shootings raise questions about arming teachers",
            "Date": "Mon, 09 Dec 2019 00:28:38 -0500",
            "Link": "https://news.yahoo.com/accidental-shootings-raise-questions-arming-052838041.html",
            "Description": "As the country looks for ways to deal with mass shootings at schools, some have responded by saying more people should carry guns, including teachers. “The only way to stop a bad guy with a gun is a good guy with a gun,” President Donald Trump told the National Rifle Association convention in April. An Associated Press investigation has found accidental shootings occur at law enforcement agencies large and small across the United States every year."
        },
        {
            "Title": "U.S. Supreme Court rejects inmate's bid for sex reassignment surgery",
            "Date": "Mon, 09 Dec 2019 10:56:52 -0500",
            "Link": "https://news.yahoo.com/u-supreme-court-rejects-inmates-155652774.html",
            "Description": "The U.S. Supreme Court on Monday refused to hear an appeal by a convicted murderer who filed a civil rights lawsuit because Texas prison officials denied her request to be considered for gender reassignment surgery. The justices let stand a lower court's decision to reject the claim by inmate Vanessa Lynn Gibson that denying the surgery request violated the U.S. Constitution's Eighth Amendment prohibition against cruel and unusual punishment. Gibson, 41, who is transgender and also goes by the name Scott in court papers, was assigned male at birth and has lived as a female since age 15."
        },
        {
            "Title": "Man wearing reindeer slippers tips woman out of wheelchair on train as he tries to steal it",
            "Date": "Mon, 09 Dec 2019 11:12:54 -0500",
            "Link": "https://news.yahoo.com/man-wearing-reindeer-slippers-tips-161254625.html",
            "Description": "A man has been arrested after a would-be thief tipped a woman out of her wheelchair on a train and attempted to steal it.CCTV footage of the incident shows a man dressed in a red jacket and reindeer slippers, who lept out of his seat and grabbed the handles of the wheelchair as the train approached a station."
        },
        {
            "Title": "Elizabeth Smart's dad, Ed, in first interview since coming out as gay: 'There is no cure'",
            "Date": "Mon, 09 Dec 2019 14:25:42 -0500",
            "Link": "https://news.yahoo.com/elizabeth-smarts-dad-ed-first-191409812.html",
            "Description": "Ed Smart told Gayle King he wanted to speak out publicly because he wanted to reach out to other gay men \"who are struggling in the same spot.\""
        },
        {
            "Title": "The United States' New 'Ninja Missile' Chops Targets to Bits (We Have Questions)",
            "Date": "Sun, 08 Dec 2019 05:00:00 -0500",
            "Link": "https://news.yahoo.com/united-states-ninja-missile-chops-100000860.html",
            "Description": "A game-changer or just some really cool marketing?"
        },
        {
            "Title": "Catholic Celebrity to Challenge Polish President in 2020 Vote",
            "Date": "Sun, 08 Dec 2019 12:22:44 -0500",
            "Link": "https://news.yahoo.com/catholic-celebrity-challenge-polish-president-172244465.html",
            "Description": "(Bloomberg) -- Szymon Holownia, a TV show host and writer known for his Catholic views, announced plans to run against incumbent Andrzej Duda in next year’s presidential election.The 43-year-old political newcomer focused his announcement on social solidarity, climate protection and higher standards in Polish politics, characterized by what he called “a devouring clinch” between the ruling Law & Justice and the main opposition party Civic Platform.“It’s time for a man coming from the bottom to fix what’s broken at the top,” he said in his announcement speech delivered in a theater in Gdansk, north of Poland. “I want a Poland in which there’s no “either-or,” but “and-and,” and where both sides can be right.”Holownia rose to fame as the co-host of Poland’s edition of “Got Talent,” a TV show he quit last month after 12 seasons. Holownia is an activist, writer and journalist supporting the liberal wing of Poland’s Catholic church. In his announcement speech, Holownia called for “friendly separation” of the church and the state.Holownia is likely to be one of at least a handful of challengers to Duda in the 2020 vote. The current president, who has the backing of the ruling camp which won the general election this year, tops all presidential and trust polls. The Civic Platform is still to pick its presidential candidate.To contact the reporter on this story: Maciej Onoszko in Warsaw at monoszko@bloomberg.netTo contact the editors responsible for this story: Hannah Benjamin at hbenjamin1@bloomberg.net, Andrew DavisFor more articles like this, please visit us at bloomberg.com©2019 Bloomberg L.P."
        },
        {
            "Title": "India's lower house passes contentious nationality bill",
            "Date": "Mon, 09 Dec 2019 15:55:52 -0500",
            "Link": "https://news.yahoo.com/protests-over-indian-nationality-bill-113938653.html",
            "Description": "India's lower house passed controversial legislation early Tuesday that will grant citizenship to religious minorities from neighbouring countries, but not Muslims, amid raucous scenes in parliament and protests in the country's northeast. \"This bill is in line with India's centuries old ethos of assimilation and belief in humanitarian values,\" Prime Minister Narendra Modi tweeted, adding that he was \"delighted\" about its passage. \"This is not a bill that is discriminatory,\" Home Minister Amit Shah said."
        },
        {
            "Title": "American soldiers banned from Italian main street after vicious brawl",
            "Date": "Sun, 08 Dec 2019 11:08:24 -0500",
            "Link": "https://news.yahoo.com/american-soldiers-banned-italian-main-155944478.html",
            "Description": "Around 2,000 US Army soldiers have been banned from one of the main streets in the Italian city of Vicenza after a  brawl between soldiers and locals.  The temporary ban, which affects members of the 173rd Airborne Brigade stationed in the city, involves the quaint via  Contra' Pescherie Vecchie, where two young Vicenza men say they were surrounded and beaten by several soldiers after a verbal exchange just outside a popular watering hole for off duty combat paratroopers.  “This is not my face. I was not like this before,” Riccardo Passaro, 21, told La Repubblica from the hospital where he is recovering from reconstructive facial surgery after his jaw was shattered.  City authorities are studying CCTV images to identify the culprits of the latest violent episode, which prompted Mayor Francesco Rucco to request special restrictive measures from the base commander.  Col. Kenneth Burgess issued a memo warning that personnel caught entering the restricted zone during the 45-day ban faced disciplinary sanctions. “It is a decree without precedent in Vicenza and for this we thank the American authorities,\" Mayor Rucco said. The US military presence in Vicenza has been expanding for the last decade, with construction of the large Del Din annex north of the historic Ederle garrison to help lodge US Africa Command and the 173rd Airborne Brigade Combat Team, which conducts contingency response and NATO ally training in Europe.  Vicenza's 113,000 inhabitants now intermingle, mostly peacefully, with more than 12,000 Americans, including military family members and employees of the two bases bookending the city.  But an uptick in problems related to heavy drinking, violence and public disorder since the expansion has exasperated locals.   In 2014,  several rape investigations and a car crash in the city centre involving three pedestrians made headlines. In 2016 and 2017 there were bloody brawls involving injuries and property damage. And in 2018, police intervened 550 times in violent incidents involving Americans, prompting new joint night patrols this year by U.S. military police and Italian Carabinieri."
        },
        {
            "Title": "World's oceans are losing oxygen at a dangerous rate, study says",
            "Date": "Sun, 08 Dec 2019 20:50:17 -0500",
            "Link": "https://news.yahoo.com/worlds-oceans-losing-oxygen-dangerous-112935261.html",
            "Description": "Scientists warn that ocean deoxygenation will have widespread global effects on marine ecosystems and the people that rely on them."
        },
        {
            "Title": "'S--- just got real': DOJ watchdog uncovers pro-Trump text messages between FBI agents after 2016 election",
            "Date": "Mon, 09 Dec 2019 14:27:11 -0500",
            "Link": "https://news.yahoo.com/just-got-real-doj-watchdog-192711162.html",
            "Description": "\"I saw a lot of scared MFers on...[my way to work] this morning,\" one FBI agent texted another. \"Start looking for new jobs fellas. Haha.\""
        },
        {
            "Title": "AOC calls out Trump after news that Amazon plans to hire 1,500 employees in New York City",
            "Date": "Sat, 07 Dec 2019 17:07:19 -0500",
            "Link": "https://news.yahoo.com/aoc-calls-trump-news-amazon-220719693.html",
            "Description": "Following reports that Amazon plans to open a new office in New York City, Rep. Alexandria Ocasio-Cortez tweeted that the Trump administration \"should focus more on cutting public assistance to billionaires instead of poor families.\""
        },
        {
            "Title": "Court to hear resentencing bid in Arizona death penalty case",
            "Date": "Mon, 09 Dec 2019 11:29:15 -0500",
            "Link": "https://news.yahoo.com/court-hear-resentencing-bid-arizona-162915508.html",
            "Description": "The U.S. Supreme Court will hear an appeal Wednesday by an Arizona death row inmate who is seeking a new sentencing trial, arguing the horrific physical abuse that he suffered as a child wasn’t fully considered when he was first sentenced. The appeal of James Erin McKinney could affect as many as 15 of Arizona's 104 death row inmates. Attorneys say the Arizona courts used an unconstitutional test in examining the mitigating factors considered during the sentencing trials of the inmates."
        },
        {
            "Title": "Erdogan says Turkey aims to settle 1 million refugees in Syria offensive area",
            "Date": "Mon, 09 Dec 2019 15:08:36 -0500",
            "Link": "https://news.yahoo.com/erdogan-says-turkey-aims-settle-200836507.html",
            "Description": "Turkey aims to settle one million Syrian war refugees in the area of northern Syria where it carried out a military incursion in October, President Tayyip Erdogan said on Monday. Turkey and its Syrian rebel allies launched the offensive against the Kurdish YPG militia, which Ankara views as a terrorist group. After seizing a strip of land inside Syria 120 km (75 miles) long and around 30 km (18 miles) wide running from the town of Ras al Ain to Tel Abyad, Turkey signed separate deals with the United States and Russia to halt its assault."
        },
        {
            "Title": "The Russian Navy Has Some Problems",
            "Date": "Mon, 09 Dec 2019 02:19:00 -0500",
            "Link": "https://news.yahoo.com/russian-navy-problems-071900960.html",
            "Description": "Yes, they received 23 new ships this year. That's where the good news ends."
        },
        {
            "Title": "Beijing Pushes for Removal of Foreign Tech in More State Offices",
            "Date": "Mon, 09 Dec 2019 02:36:21 -0500",
            "Link": "https://news.yahoo.com/beijing-orders-removal-foreign-tech-004222265.html",
            "Description": "(Bloomberg) -- Terms of Trade is a daily newsletter that untangles a world embroiled in trade wars. Sign up here. The Chinese government is taking further steps to remove foreign technology from state agencies and other organizations, a clear sign of determination for more independence amid escalating tensions with the U.S.Beijing will likely replace as many as 20 million computers at government agencies with domestic products over the next three years, according to research from China Securities. More than 100 trial projects for domestic products were completed in July, the brokerage firm said. The Financial Times newspaper said the Communist Party’s Central Office earlier this year ordered state offices and public institutions to shift away from foreign hardware and software.The government under President Xi Jinping has been trying for years to replace technologies from abroad, and particularly from the U.S. Bloomberg News reported in 2014 that Beijing was aiming to purge most foreign technology from its banks, the military, government agencies and state-owned enterprises by 2020. The country’s Made in China 2025 plan also set out specific goals for technology independence, although the policy has been de-emphasized after contributing to trade war tensions.U.S. President Donald Trump’s aggressive policies against China and its leading companies have given the effort renewed urgency. His administration banned U.S. companies from doing business with Huawei Technologies Co. this year and blacklisted other Chinese firms.“The trade war has exposed various areas of Chinese economic weakness, which Beijing seems determined to rectify,” said Brock Silvers, managing director of Adamas Asset Management. “If the decision pushes Trump to finally come down hard with a more forceful ban of Chinese tech, however, China may one day regret having gone so public with its policy so soon.”While the current push is narrow in scope, it is designed as part of the broad, long-standing effort to decrease China’s reliance on foreign technologies and boost its domestic industry. The goal is to substitute 30% of hardware in state agencies next year, 50% in 2021 and 20% in 2022, China Securities estimated, based on government requests and clients’ budgets.The research, from September, detailed Beijing’s goals. The FT reported the number of computers to be replaced could reach 30 million, attributing the figures to China Securities. The newspaper said the goal is to use “secure and controllable” technology as part of the country’s Cyber Security Law passed in 2017.Starting next year, key industries such as finance, energy and telecom will test more domestic products in trials that may last years, the firm said. Chinese banks are supposed to shift from International Business Machines Corp. and Oracle Corp. to more diversified X86 architecture suppliers and then eventually to fully made-in-China hardware. China has decided to adopt ARM architecture for its domestic hardware, China Securities said.“The China-U.S. trade war could also help to breed a new market for home-made products,” China Securities analyst Shi Zerui wrote.Still, Beijing’s push has proven difficult because its domestic industry hasn’t yet shown itself capable of matching foreign technologies in certain sectors. Particularly hard to replace, for example, are semiconductors from suppliers like Intel Corp. and Nvidia Corp., as well as software from Microsoft Corp. and Apple Inc.“While large suppliers such as Microsoft and IBM are undoubtedly worried, many high-end components, like chipsets, can’t be easily replaced,” Silvers said.\\--With assistance from Debby Wu.To contact Bloomberg News staff for this story: Gao Yuan in Beijing at ygao199@bloomberg.netTo contact the editors responsible for this story: Peter Elstrom at pelstrom@bloomberg.net, Vlad SavovFor more articles like this, please visit us at bloomberg.com©2019 Bloomberg L.P."
        },
        {
            "Title": "Screams and goodbyes as scores die in devastating India factory fire",
            "Date": "Sun, 08 Dec 2019 15:56:19 -0500",
            "Link": "https://news.yahoo.com/least-43-killed-horrific-factory-fire-indias-capital-001037131.html",
            "Description": "At least 43 people were killed Sunday in a devastating fire that ripped through a bag factory in the congested old quarter of the Indian capital New Delhi, with survivors describing the screams of workers trapped inside. The blaze was the worst in Delhi since 59 movie-goers died in a cinema in 1997. The cause of the blaze is not yet known, but the city's poor planning and lax enforcement of building and safety codes have often been blamed for such deadly incidents."
        },
        {
            "Title": "Milo, the cat who went missing at Dulles airport in October, is reunited with owner",
            "Date": "Mon, 09 Dec 2019 11:09:12 -0500",
            "Link": "https://news.yahoo.com/milo-cat-went-missing-dulles-153335358.html",
            "Description": "\"Guess who’s home for the holidays!\" wrote Molly McFadden, who has been reunited with Milo the cat, who went missing at Dulles Airport in October."
        },
        {
            "Title": "Three sailors killed in Pensacola shooting identified",
            "Date": "Sun, 08 Dec 2019 03:38:01 -0500",
            "Link": "https://news.yahoo.com/brother-says-pensacola-shooting-victim-074323909.html",
            "Description": "Joshua Kaleb Watson was one of three people killed by a gunman Friday at Naval Air Station Pensacola"
        },
        {
            "Title": "Trump news: Republicans attempt to stonewall impeachment hearing as witnesses outline damning evidence to remove president",
            "Date": "Mon, 09 Dec 2019 13:54:00 -0500",
            "Link": "https://news.yahoo.com/trump-news-live-president-launches-084200597.html",
            "Description": "Donald Trump has claimed victory after Justice Department inspector general Michael Horowitz released his report claiming that the FBI did not pursue a politically motivated investigation into the 2016 Trump campaign — but that agents did tend to favour damaging evidence over exculpatory evidence as the investigation continued.The report was released as House Judiciary Committee presented and reviewed the evidence accumulated so far in the impeachment inquiry, with charges against the president expected to be drawn up by the end of the week ahead of a potential pre-Christmas vote in the House of Representatives."
        },
        {
            "Title": "Boeing is promising 3 fixes to the faulty system behind the 737 Max crashes to let pilots stop it from forcing the plane into an unstoppable nosedive",
            "Date": "Mon, 09 Dec 2019 08:12:16 -0500",
            "Link": "https://news.yahoo.com/boeing-promising-3-fixes-faulty-131216149.html",
            "Description": "MCAS, which was designed to automatically push the plane's nose down to stabilize it, was identified as a key factor in both 737 Max crashes."
        },
        {
            "Title": "Stocks slip as investors weigh outlook for US-China trade",
            "Date": "Mon, 09 Dec 2019 04:27:49 -0500",
            "Link": "https://news.yahoo.com/european-shares-fall-asia-advances-092749776.html",
            "Description": "Stock markets weakened during European trading on Monday as investors weighed the possibility of more U.S. tariffs on China and the outlook for negotiations on the trade dispute. A Chinese official said that Beijing wants a prompt settlement of its trade war with Washington as another U.S. tariff hike on $160 billion of Chinese imports is due to take effect Sunday. China announced Friday it was carrying out a promise to waive punitive tariffs on American soybeans and pork."
        },
        {
            "Title": "Amid flurry of Saudi reforms, mocktails on order in execution square",
            "Date": "Mon, 09 Dec 2019 06:00:00 -0500",
            "Link": "https://news.yahoo.com/amid-flurry-saudi-reforms-mocktails-110000115.html",
            "Description": "For decades, criminals in Saudi Arabia were lined up after Friday prayers at a central Riyadh plaza and beheaded by sword in a gruesome public spectacle overseen by the religious police. Such jarring contrasts are accompanying the rapid social changes under Crown Prince Mohammed bin Salman, like lifting bans on women driving, gender mixing and public entertainment. Many Saudis embrace the new openness, but even supporters worry it might be coming too quickly and risks provoking a conservative backlash."
        },
        {
            "Title": "F-117 Stealth Fighters Are Playing the Enemy (Taking on F-22s, F-15s and F-16s)",
            "Date": "Mon, 09 Dec 2019 00:30:00 -0500",
            "Link": "https://news.yahoo.com/f-117-stealth-fighters-playing-053000632.html",
            "Description": "“I witnessed an F-117 along with four F-16s go up against F-15s and F-22s. The F-117's callsign was KNIGHT, the F-16s were GOMER and MIG, and they were communicating on the aggressor frequency.”"
        },
        {
            "Title": "Singapore Says Fighter Jet Unit on Guam Is Sign of ‘Trajectory’",
            "Date": "Sat, 07 Dec 2019 21:32:54 -0500",
            "Link": "https://news.yahoo.com/singapore-says-fighter-jet-unit-023254874.html",
            "Description": "(Bloomberg) -- Singapore’s agreement to establish a fighter jet training detachment on Guam “sets the trajectory” in which the city-state sees itself in partnership with the U.S, its defense chief said.Defense Minister Ng Eng Hen and U.S. Secretary of Defense Mark Esper signed the agreement, which followed the recent renewal of a pact that allows American forces use of Singapore bases, according to a statement on the Singapore Ministry of Defence’s website.Most leaders and people in Asia would say they want America’s presence to be continued, Ng said Saturday at the Reagan National Defense Forum in Simi Valley, California. “They don’t want to choose between great power rivalry between the U.S. and China, but they also both want to be involved, including other powers.”Ng said U.S. domestic politics, which he described as “not business as usual” and “hard not to notice,” are causing an adjustment in policy, without elaborating.To contact the reporters on this story: Wes Goodman in Singapore at wgoodman@bloomberg.net;Glen Carey in Washington at gcarey8@bloomberg.netTo contact the editors responsible for this story: Shamim Adam at sadam2@bloomberg.net, Keith GosmanFor more articles like this, please visit us at bloomberg.com©2019 Bloomberg L.P."
        },
        {
            "Title": "Former Australian PM, Bob Hawke, pleaded with daughter not to report alleged rape by political ally to police",
            "Date": "Sun, 08 Dec 2019 15:50:14 -0500",
            "Link": "https://news.yahoo.com/bob-hawke-pleaded-daughter-not-205014706.html",
            "Description": "Former Australian Prime Minister Bob Hawke pleaded with his daughter not to report being raped by a Labor MP fearing the case could damage his political career, it is claimed in court documents. The allegations against Mr Hawke, who died in May aged 89, have been made by his second daughter Rosslyn Dillon, 59, in a legal claim against her father's estate. Ms Dillon is seeking 4 million Australian dollars (£2 million) from her father's $18 million estate, rather than the $750,000 she was left.  In a 25-page affidavit lodged at the New South Wales Supreme Court and reported by The New Daily, she claims she was raped by Bill Landeryou, a Labor MP and close ally of Mr Hawke,  who died in February aged 77. Ms Dillon alleges she was sexually assaulted three times: at a Hilton hotel, in parliament and at the MP's home. \"These instances of sexual assault occurred during a period when, to my knowledge, my father was preparing to challenge the current Leader of the Opposition for the role of Leader of the Australian Labor Party,\" she alleges in the affidavit. She confronted her father, who was soon to become Australian Prime Minister, with the allegations at the family home. Mr Hawke replied: “You can’t go to the police. You can’t. I can’t have any controversies right now. I am sorry but I am challenging for the leadership of the Labor Party.” Ms Dillon says she was \"shocked and hurt\" by her father's request. \"He asked me to let the matter go for him and I did so for him. \"I am still haunted by the sexual assaults. I feel that I may have had a chance to get over these rapes if I was able to report the incidents to police.\" Ms Dillon says her share of the estate is inadequate given the impact the sexual assaults had on her mental health. Her older sister, Sue Pieters-Hawke, has confirmed Ms Dillon did tell her about the assaults. Mr Hawke did succeed in securing the party leadership and led Labor to four election victories in succession."
        },
        {
            "Title": "Michigan man died of overdose from prison drug ring run by guards, lawsuit says",
            "Date": "Mon, 09 Dec 2019 14:26:12 -0500",
            "Link": "https://news.yahoo.com/michigan-man-died-overdose-prison-141756940.html",
            "Description": "The operation was allegedly orchestrated by a corrections officer and a prisoner with whom she had a romantic relationship with, the lawsuit says."
        },
        {
            "Title": "Melania Trump unveils White House Christmas decorations",
            "Date": "Mon, 09 Dec 2019 06:58:24 -0500",
            "Link": "https://news.yahoo.com/melania-trump-unveils-white-house-120343005.html",
            "Description": "The first lady released photos and a video of 1600 Pennsylvania Avenue decorated for Christmas with the theme \"The Spirit of America.\""
        },
        {
            "Title": "TV crew laugh at Ted Cruz in live interview after he endorses Trump's baseless conspiracy theory",
            "Date": "Mon, 09 Dec 2019 04:53:01 -0500",
            "Link": "https://news.yahoo.com/tv-crew-laugh-ted-cruz-095301079.html",
            "Description": "Ted Cruz was laughed at by a TV crew during a live interview after he endorsed Donald Trump’s baseless conspiracy theory about Ukraine.The Texas senator, who challenged Mr Trump to be the Republican nominee in 2016, was mocked for saying he believed there was “considerable evidence” that Ukraine meddled in the most recent presidential election."
        },
        {
            "Title": "US sanctions Venezuela officials for selling passports for cash",
            "Date": "Mon, 09 Dec 2019 12:52:39 -0500",
            "Link": "https://news.yahoo.com/us-sanctions-venezuela-officials-selling-passports-cash-175239058.html",
            "Description": "The United States on Monday slapped sanctions on senior Venezuelan government officials accused of taking bribes to issue passports, the US Treasury said. The sanctions targeted Gustavo Adolfo Vizcaino Gil, head of the government department in charge of identification documents and migration, as well as his predecessor Juan Carlos Dugarte Padron, the Treasury's Office of Foreign Assets Control said. It said the scheme to sell passports for thousands of dollars dated back at least to April 2016 when Dugarte was named as head of the government department and continued under Vizcaino, who took over in June 2018."
        },
        {
            "Title": "Pope names Manila Cardinal Tagle to major Vatican post",
            "Date": "Sun, 08 Dec 2019 13:16:15 -0500",
            "Link": "https://news.yahoo.com/pope-names-manila-cardinal-tagle-181523206.html",
            "Description": "Pope Francis has named Manila Cardinal Luis Antonio Tagle to head the Congregation for the Evangelization of the Peoples."
        },
        {
            "Title": "Rapper Juice WRLD dies after emergency at Chicago airport",
            "Date": "Sun, 08 Dec 2019 12:50:27 -0500",
            "Link": "https://news.yahoo.com/rapper-juice-wrld-dies-emergency-175027090.html",
            "Description": "Chicago-area rapper Juice WRLD, whose real name is Jarad A. Higgins, was pronounced dead Sunday after a \"medical emergency\" at Chicago's Midway International Airport, according to authorities."
        },
        {
            "Title": "America Needs A Navy Base In Australia",
            "Date": "Sun, 08 Dec 2019 19:00:00 -0500",
            "Link": "https://news.yahoo.com/america-needs-navy-australia-000000715.html",
            "Description": "For more than just countering China."
        }
    ]
]