[
    "Yahoo News - Latest News & Headlines",
    [
        {
            "Title": "Did Democrats just help Trump win reelection?",
            "Date": "2019-12-12 11:05:47-05:00",
            "Link": "https://news.yahoo.com/did-democrats-just-help-trump-win-reelection-160547285.html",
            "Description": "House Democrats have officially agreed to back a revised version of Trump’s new trade pact ­— an announcement made just one hour after House Democratic leaders unveiled articles of impeachment against him.",
        },
        {
            "Title": "New Zealand volcano eruption: elite military team recovers six bodies from White Island as divers continue hunt",
            "Date": "2019-12-13 02:37:07-05:00",
            "Link": "https://news.yahoo.com/zealand-volcano-eruption-search-team-023338314.html",
            "Description": "A team of expert divers will continue looking for the last two missing victims of the White Island eruption on Saturday, after the New Zealand Defence Force and police recovered six bodies from the island on Friday in a high-risk operation.  Deputy Commissioner of Police Mike Clement had warned that “a lot will have to go right” for the mission to succeed, and scientists had alerted police to a 50-60 per cent chance of another eruption, but the operation went to plan.  On Friday morning Police Commissioner Mike Bush said in a statement that “at least one body is in the water” and divers on the police vessel Deodar were attempting to recover that body.  “We're making every effort to locate and recover the two remaining deceased,” Commissioner Bush said.“This has been a harrowing event for the Whakatane community and those family and friends directly impacted by the eruption of White Island [also known as Whakaari] on Monday,” he said. This aerial photo shows White Island after its volcanic eruption in New Zealand Monday, Dec. 9, 2019 Credit: George Novak/New Zealand Herald “The operation today went to plan and we would like to recognise our partners at NZDF who have provided the specialist skills and resources to help us deliver this part of the operation… The operation was not without risk but thanks to sound planning and the skills of the specialist team involved we have recovered the six bodies.” Commissioner Bush said the environment the recovery team faced was “highly unpredictable and challenging”. GNS Science volcanologist Graham Leonard had warned that in addition to the risk of eruption, the mission would face an environment in which it would, at times, be difficult to breathe and see. Pictures of the recovery operation showed pairs of military personnel wearing breathing apparatus scouring the lunar-like landscape as inflatable dinghies and a police launch waited offshore. Six bodies have been successfully recovered from White Island and are now on board HMNZS Wellington Credit: Getty Commissioner Bush said the recovery team “showed absolute courage and commitment to ensure we can offer some closure to the families and friends of those who have lost loved ones”. “Our thoughts are with the families of the deceased and we thank Iwi [the Maori people] and the local community for their support of the victims of this tragedy,” he said. Speaking to reporters after the six bodies were retrieved, Prime Minister Jacinda Ardern said questions over why people were allowed to visit the active volcano “must be answered, and will be answered”.  New Zealand volcano An investigation is being conducted on behalf of the coroner, and an occupational health and safety investigation is also being conducted by WorkSafe, New Zealand’s peak workplace safety organisation.  The Prime Minister said the time would come for accountability, but added “we also need to respect the phase we're in now, with families only just getting their loved ones back”. There are now 14 confirmed dead from the tragedy. Twenty-six people remain in hospital receiving intensive medical treatment for severe burns, the majority of whom are in critical condition. The volcano, a popular tourist destination for day-trippers, erupted on Monday, spewing ash, steam and gases over the island. Among the 47 people on the island at the time were Australian, US, German, Chinese, British and Malaysian tourists.",
        },
        {
            "Title": "Meghan McCain Confronts Tom Steyer: ‘You Bought Your Way’ Onto Debate Stage",
            "Date": "2019-12-13 12:30:06-05:00",
            "Link": "https://news.yahoo.com/meghan-mccain-confronts-tom-steyer-173006640.html",
            "Description": "2020 Democratic presidential candidate Tom Steyer got a warm welcome from every co-host of The View except one on Friday morning. “Mr. Steyer, between you and Mayor Bloomberg, you have now spent $200 million on political ads,” Meghan McCain told their guest. “It hasn't really helped you very much in the polls, but you did make it to the next debate stage. I think you bought your way there, and I don't think it's fair that you’re there and Cory Booker isn't. Change my mind.” After letting out an uncomfortable chuckle, Steyer skirted the question by touting his message about a “broken” government “bought by corporations.” When the candidate pointed out that he has been spending time in the early primary states—unlike that other billionaire—McCain shot back, “Cory Booker has too, who doesn't have $200 million.” “I’m talking about breaking a corporate stranglehold on our government that is preventing it from acting on anything,” Steyer said. “And no one can say that I have been purchased, but I also have 10 years of putting together coalitions like the people in this audience to stand up for our rights and to take on unchecked corporate power that has bought our government.” “But it’s good you have $100 million to buy Facebook ads to get you on a debate stage,” McCain said, interrupting him. “I’m completely unconvinced by this, but we can move on.” Later in the segment, after Steyer vowed to help elect whoever the Democratic nominee ends up being and reminded the hosts that he started “one of the biggest grassroots organizations in the United States,” McCain came back with, “That doesn’t make you a good politician, with all due respect.” “Mayor Bloomberg was mayor for three terms, and so if you’re going to go the billionaire route,” she continued, with a dramatic eye roll, “he's a lot more compelling than you are.” Meghan McCain: Greta Thunberg Didn’t ‘Earn’ Person of the YearRead more at The Daily Beast.Got a tip? Send it to The Daily Beast hereGet our top stories in your inbox every day. Sign up now!Daily Beast Membership: Beast Inside goes deeper on the stories that matter to you. Learn more.",
        },
        {
            "Title": "Jersey City shooter was Army veteran with a lengthy criminal history",
            "Date": "2019-12-12 18:36:34-05:00",
            "Link": "https://news.yahoo.com/jersey-city-shooter-army-veteran-233535995.html",
            "Description": "David Anderson, was arrested at least five times since 2003, the year he was discharged from the Army, records show.",
        },
        {
            "Title": "Chile: Plane that vanished en route to Antarctica found",
            "Date": "2019-12-12 10:37:14-05:00",
            "Link": "https://news.yahoo.com/chile-plane-vanished-en-route-153714597.html",
            "Description": "Searchers combing Antarctic seas have recovered parts of a military transport plane and human remains belonging to some of the 38 people aboard who vanished en route to the frozen continent, Chilean officials said Thursday. Air Force Gen. Arturo Merino said at a news conference that based on the condition of the remains, he believed it would be “practically impossible” that any survivors would be pulled from the water alive. An international team of searchers continued the hunt, while officials on shore said they would use DNA analysis to identify the crash victims.",
        },
        {
            "Title": "Some 1,100 car shoppers said they'd rather buy an electric pickup truck from Ford or GM than Tesla's Cybertruck — but there's a silver lining for Tesla in the survey",
            "Date": "2019-12-12 12:35:00-05:00",
            "Link": "https://news.yahoo.com/1-100-car-shoppers-said-193244472.html",
            "Description": "Tesla's Cybertruck may have a hard time converting Ford F-150 and Chevrolet Silverado owners, but it might open up a new segment of the pickup market.",
        },
        {
            "Title": "Meet the Navy's Small Warships That Help to Deter Iran",
            "Date": "2019-12-12 04:45:00-05:00",
            "Link": "https://news.yahoo.com/meet-navys-small-warships-help-094500332.html",
            "Description": "Spunky and important little boats.",
        },
        {
            "Title": "GOP lawmaker fires back after being accused of downplaying Ukrainian deaths",
            "Date": "2019-12-13 07:57:09-05:00",
            "Link": "https://news.yahoo.com/gop-lawmaker-fires-back-being-125709306.html",
            "Description": "Republican Rep. Doug Collins of Georgia, the ranking member on the House Judiciary Committee, fired back at a Democratic colleague in one of the more testy exchanges in the 14 hours of debate during Thursday's impeachment hearing.",
        },
        {
            "Title": "Malaysia seizes Vietnamese oil tanker that was tracked in North Korea",
            "Date": "2019-12-12 06:43:28-05:00",
            "Link": "https://news.yahoo.com/malaysia-seizes-vietnamese-oil-tanker-114328887.html",
            "Description": "KUALA LUMPUR/SINGAPORE (Reuters) - A Vietnamese oil tanker which Reuters reported visited North Korea in February has been seized by Malaysia after it was found adrift off the Malaysian coast, maritime agency officials said. Refinitiv shipping data quoted by Reuters showed the Viet Tin 01 arrived just outside the harbor of Nampo on North Korea's western coast on Feb. 25 carrying 2,000 tonnes of gasoline, shortly before talks between North Korean leader Kim Jong Un and U.S. President Donald Trump in Hanoi. It was not clear whether the tanker unloaded cargo at Nampo.",
        },
        {
            "Title": "Trump mocks Greta Thunberg's Time Person of the Year honor: 'So ridiculous'",
            "Date": "2019-12-12 08:06:43-05:00",
            "Link": "https://news.yahoo.com/trump-mocks-greta-thunberg-time-person-of-the-year-movie-chill-130643126.html",
            "Description": "President Trump on Thursday mocked Greta Thunberg after the Swedish teenage climate activist was named Time magazine’s Person of the Year, edging out finalists including House Speaker Nancy Pelosi, Hong Kong protesters — and him.",
        },
        {
            "Title": "Dem Leaders Expect a Group of Swing-State Lawmakers to Defect on Impeachment Vote",
            "Date": "2019-12-12 09:10:12-05:00",
            "Link": "https://news.yahoo.com/dem-leaders-expect-group-swing-141012029.html",
            "Description": "House Democrats are worried that the caucus could lose six or more moderate votes on impeachment, according to multiple officials who spoke anonymously to the Washington Post.When the House voted to formalize impeachment on October 31, all but two Democrats — Jeff Van Drew of New Jersey and Collin C. Peterson of Michigan — voted with House leadership. Amidst concerns from moderates, who on Monday considered reviving a proposal to censure President Trump rather than impeach him, the fate of the impeachment vote is a bit less certain.House Speaker Nancy Pelosi could afford to lose 17 votes and still prevail with the vote, which will likely get the approval of former Republican Justin Amash. But House leadership is not whipping votes to ensure success, despite Pelosi saying in July that “censure is nice, but it is not commensurate with the violations of the Constitution should we decide [impeachment is] the way to go.”“This is one of those issues where members have to come to their own conclusions; it’s just too consequential,” Daniel Kildee (D., Mich.), a deputy whip, said. “I think this is one of those votes where people are going to be remembered for a long time for how they voted on it.”Moderates who initially voiced support for impeachment have been worried over polling which shows that support for impeachment has largely flatlined after the public hearings, the Post reports. Republican efforts to reclaim the House in 2020 have zeroed in on impeachment to target vulnerable districts, with the White House joining in in October.On Tuesday, freshman Representative Elissa Slotkin (D., Mich.) — who represents a district which voted for Trump in 2016 — said she was “undecided” on the vote, despite signing a September op-ed in support of impeachment. Slotkin was heckled by constituents during a town hall in October for her impeachment defense, and said Wednesday that “the phones are ringing off the hook” from people on both sides of the issue.",
        },
        {
            "Title": "Small plane makes emergency landing on California interstate",
            "Date": "2019-12-12 22:38:59-05:00",
            "Link": "https://news.yahoo.com/small-plane-makes-emergency-landing-033859950.html",
            "Description": "The single-engine Cessna had two people on board when it landed on Interstate 5's center divider in Carlsbad as smoke filled the cockpit. Both were unhurt.",
        },
        {
            "Title": "Cosmic rarity: New image shows interstellar comet zooming past the sun",
            "Date": "2019-12-12 17:30:15-05:00",
            "Link": "https://news.yahoo.com/cosmic-rarity-image-shows-interstellar-223015700.html",
            "Description": 'Comet 2I/Borisov, only the second interstellar object ever spotted in our solar system, is racing through our celestial neighborhood at the "breathtaking" speed of 110,000 mph.',
        },
        {
            "Title": "Charges dropped, brothers in hemp-pot mixup look to sue NYC",
            "Date": "2019-12-11 19:45:55-05:00",
            "Link": "https://news.yahoo.com/charges-dropped-brothers-move-sue-004555999.html",
            "Description": "The bust was a bust, and it could end up costing New York City some serious green. A day after prosecutors dropped criminal charges in a case spotlighting confusion over hemp, marijuana and conflicting laws, the Brooklyn brothers caught in the chaos took the first step toward suing the city and the police department. Oren and Ronen Levy filed notices of claim Wednesday, saying the “nightmare” ordeal that began with Ronen's Nov. 2 arrest and the seizure of 106 pounds (48 kilograms) of hemp plants tarnished their reputations and threatened their livelihoods selling CBD, the extract showing up lately in everything candy to coffee.",
        },
        {
            "Title": "The 10 Best Tech Gadgets of 2019",
            "Date": "2019-12-13 14:58:00-05:00",
            "Link": "https://news.yahoo.com/10-best-tech-gadgets-2019-195800554.html",
            "Description": "",
        },
        {
            "Title": "A growing number of Republicans say they're satisfied with US healthcare costs — even as insurance prices have surged 20% in the past year",
            "Date": "2019-12-12 12:13:48-05:00",
            "Link": "https://news.yahoo.com/growing-number-republicans-theyre-satisfied-171348733.html",
            "Description": "The poll suggests that heightened partisanship is swaying Republicans on healthcare just as it has been on the economy",
        },
        {
            "Title": "Taiwan Still Has a Giant World War II-Era Artillery Gun (Pointed at China)",
            "Date": "2019-12-13 03:49:00-05:00",
            "Link": "https://news.yahoo.com/taiwan-still-giant-world-war-084900603.html",
            "Description": "Could it fight?",
        },
        {
            "Title": "Israel bars Gaza's Christians from visiting Bethlehem and Jerusalem at Christmas",
            "Date": "2019-12-12 14:12:43-05:00",
            "Link": "https://news.yahoo.com/israel-bars-gazas-christians-visiting-191243273.html",
            "Description": "JERUSALEM/GAZA, Dec 12 (Reuters) - Christians in the Gaza Strip will not be allowed to visit holy cities such as Bethlehem and Jerusalem to celebrate Christmas this year, Israeli authorities said on Thursday. Gazan Christians will be granted permits to travel abroad but none will be allowed to go to Israel and the occupied West Bank, home to many sites holy to Christians, a spokeswoman for Israel's military liaison to the Palestinians said.",
        },
        {
            "Title": "Democrats Aren’t Feeding the Impeachment Trolls",
            "Date": "2019-12-12 18:12:41-05:00",
            "Link": "https://news.yahoo.com/democrats-aren-t-feeding-impeachment-231241142.html",
            "Description": "(Bloomberg Opinion) -- As the House Judiciary Committee continues to consider the articles of impeachment, many close observers are saying that Democrats are all too content to sit on the sidelines while Republicans slam the proceedings as a sham. That’s not entirely true, of course. When Republicans argued that Congress should always defer to the courts when presidents defy House subpoenas, California’s Zoe Lofgren gave an extremely strong defense of the rights of Congress, while also noting that President Donald Trump’s refusal to cooperate with the investigation was made without raising any particular privilege. In other words, Trump and the House aren’t arguing over a particular point of constitutional interpretation; Trump is simply asserting that he doesn’t have to cooperate if he doesn’t want to. That’s something, as Lofgren argued, that’s up to Congress to remedy. But in several cases, Democrats are letting thing go. Journalist Marcy Wheeler, who knows this material as well as anyone, is among those frustrated. She recently tweeted, “Dems are really acting negligent here. There’s so much to respond to this one.”Is she right? Are Democrats being negligent or simply getting rolled? Or have they made a strategic choice?There is some upside to allowing Republicans to rant on and on — especially the ones who prefer to shout. At a certain point, the objections begin to sound like white noise, or the mumbly adults in Charlie Brown’s world. If Democrats were to challenge them, it would elevate the Republican points and bait the news media into presenting bland reports about “both sides” of the debate — a debate that they would rather not have. Instead, Democrats are typically using their time to make their case for impeaching Trump. That’s not a bad strategy given the alternative. The media loves to do political analysis — how the impeachment is playing, what the electoral implications are — rather than just saying what happened.(2) And especially when the likely outcome in the Senate is an acquittal, the House procedures are likely to produce stories about the futility of the Democrats’ actions, rather than about what Democrats see as the extent of Trump’s malfeasance and the importance of impeachment. At the same time, Republicans appear to be mainly concerned not with convincing anyone, but in producing talking points for Republican-aligned media. That’s why they don’t mind repeating entirely discredited assertions, such as the claim that former Vice President Joe Biden was attempting to stop an investigation into his son’s company by getting a Ukrainian prosecutor fired when in fact Biden was — as the witnesses all said — trying to get Ukraine to replace a corrupt prosecutor who wasn’t investigating that company with one who would fight corruption. What this means is that even when Democrats do counter Republican points, it won’t change anything.Granted, it is very frustrating to those who are watching along at home and seeing opportunities for their side to score debating points. For better or worse, that’s not how anyone keeps score of these kinds of events.(1) Not that I'm complaining; that's a lot of what I do here at Opinion. It can be valuable!To contact the author of this story: Jonathan Bernstein at jbernstein62@bloomberg.netTo contact the editor responsible for this story: Mike Nizza at mnizza3@bloomberg.netThis column does not necessarily reflect the opinion of the editorial board or Bloomberg LP and its owners.Jonathan Bernstein is a Bloomberg Opinion columnist covering politics and policy. He taught political science at the University of Texas at San Antonio and DePauw University and wrote A Plain Blog About Politics.For more articles like this, please visit us at bloomberg.com/opinion©2019 Bloomberg L.P.",
        },
        {
            "Title": "Iraq mob lynches 16-year-old after he attacked and killed anti-government protesters",
            "Date": "2019-12-12 10:47:32-05:00",
            "Link": "https://news.yahoo.com/iraq-mob-lynches-16-old-154732601.html",
            "Description": 'An angry mob killed a 16-year-old and strung up the corpse by its feet from a traffic pole after the teen shot and killed six people on Thursday, including four anti-government protesters, Iraqi officials said. Dozens of people pointed their cellphones at the body dangling high above them in a central Baghdad square. Videos circulating on social media showed the young man being beaten and dragged across the street. The violence underscored the growing fears and suspicions swirling around the 8-week-old protest movement, which engulfed Iraq on October 1 when thousands took to the streets to decry government corruption, poor services and scarcity of jobs. A string of mysterious acts of bloodshed by unknown groups has put anti-government protesters on edge and eroded their faith in the ability of state security forces to protect them. Last Friday, 25 protesters were killed when gunmen in pickup trucks opened fire in Baghdad\'s Khilani Square. That same week, mysterious knife attacks targeted over a dozen anti-government protesters in Tahrir Square, the hub of the protest movement. In recent days, abductions and assassinations of high-profile civil activists have stoked paranoia among demonstrators. Protesters largely blame Iran-backed militias for the attacks and see the violence as a campaign to instill fear and weaken their peaceful movement. Thursday\'s bloodshed began when the young gunman opened fire in Baghdad\'s Wathba Square, killing two shop owners and four protesters. Security officials said the teen was wanted by police on drug-related charges and was running from security forces at the time. An enraged mob beat the young man to death, security and health officials said. The officials spoke on condition of anonymity in line with regulations. At least eight people were wounded, the officials said. Influential Shiite cleric Muqtada al-Sadr called those who killed the teen "terrorists" and warned that if they were not identified within 48 hours, he would order his militia to leave the square. Members of Saraya Salam, or Peace Brigades, are deployed in the square to protect protesters. Protesters refer to them as the "blue hats." The killing of the teenager was condemned by the wider protest movement in Tahrir Square, which said in a statement that the perpetrators were not part of their peaceful demonstrations. "We can\'t allow the image of our pure revolution to be distorted, so we declare that we are innocent as peaceful demonstrators to what happened this morning in Wathba Square," the statement said.',
        },
        {
            "Title": "The 25 Best Adventure Games",
            "Date": "2019-12-12 09:00:00-05:00",
            "Link": "https://news.yahoo.com/25-best-adventure-games-140000913.html",
            "Description": "",
        },
        {
            "Title": "Stomach flu outbreak terrorizes school in Washington state, sickening over 100 students, staff",
            "Date": "2019-12-13 07:31:26-05:00",
            "Link": "https://news.yahoo.com/norovirus-outbreak-terrorizes-school-washington-122322773.html",
            "Description": "A number of schools from Seattle Public Schools and Vancouver Public Schools were forced to close to disinfect and clean because of the outbreak.",
        },
        {
            "Title": "Death toll in aircraft carrier fire in Russia rises to 2",
            "Date": "2019-12-13 08:35:30-05:00",
            "Link": "https://news.yahoo.com/death-toll-aircraft-carrier-fire-133530727.html",
            "Description": "A crew member who went missing during a fire on Russia's only aircraft carrier was found dead Friday, raising the death toll from the blaze to two, the nation's military officials said Friday. The fire on the Admiral Kuznetsov broke out during welding work at a shipyard in the Arctic port of Murmansk on Thursday and spread quickly through the carrier's internal compartments. The military reported two crew members dead, and authorities in Murmansk said 11 other people were injured.",
        },
        {
            "Title": "Eagle v octopus: Canadians rescue bird locked in battle with giant mollusc",
            "Date": "2019-12-12 12:17:33-05:00",
            "Link": "https://news.yahoo.com/eagle-v-octopus-canadians-rescue-165820454.html",
            "Description": "Employees at a fish farm in Vancouver intervened when an eagle tried to eat a large octopus, resulting in a battleA bald eagle on Canada’s west coast has learned that its eyes may be bigger than its stomach after it was nearly drowned by an octopus it tried to eat.After hearing shrieks coming from the water on the north-western tip of Vancouver Island, employees at a fish farm investigating the noises happened upon a bird and cephalopod locked in battle.The octopus, which had turned a deep crimson, had wound its tentacles tightly around the eagle, which was floating helplessly at the surface.“At first we just watched and we didn’t know if we should interfere because, you know, it’s Mother Nature,” said John Ilett, an employee at Mowi West Canada, told CTV News.But realizing the eagle was likely to drown, the crew ultimately decided to intervene.Ilett maneuvered a pike pole in the water to pull the octopus over to the boat. The crew managed to haul both aboard, disentangling the bird from the strong tentacles, before tossing the octopus back into the water.“That was amazing. Look at the size of this [expletive],” said one worker as the octopus hovered briefly at the surface.“Holy [expletive],” another worker adds as the crew laughs in disbelief.Workers said the octopus was the largest theyhad ever encountered, and probably measured more than four and a half feet across.But much larger individuals lurk in the deeps: octopuses in the region – including the giant Pacific octopus – can grow to more than 25ft in diameter.After the eagle was pried from its grasp, the octopus dove back into the depths, its colours subtly shifting from reddish to brown.The shaken eagle perched warily on a nearby log before flying off.“It was a very cool situation,” said Ilett. “I’ve been out here 20 years and that’s one of the coolest things I’ve ever seen.”",
        },
        {
            "Title": "Republican congressman publicly identifies purported whistleblower",
            "Date": "2019-12-12 17:52:54-05:00",
            "Link": "https://news.yahoo.com/republican-congressman-publicly-identifies-purported-225254254.html",
            "Description": "On Wednesday, Rep. Louie Gohmert publicly named a person some Republicans and allies of President Trump claim is the alleged whistleblower who first brought the Trump-Ukraine scandal to light.",
        },
        {
            "Title": "Army divers wore gear from the 1940s to inter a Pearl Harbor survivor on the USS Arizona",
            "Date": "2019-12-12 19:55:13-05:00",
            "Link": "https://news.yahoo.com/army-divers-wore-gear-1940s-005513297.html",
            "Description": "It was the first time the interment ceremony was performed with the divers wearing the vintage diving kit.",
        },
        {
            "Title": "California police officer involved in two fatal shootings in one year",
            "Date": "2019-12-13 15:05:35-05:00",
            "Link": "https://news.yahoo.com/california-police-officer-involved-two-200535269.html",
            "Description": "A new report has found that a California police officer was involved in two fatal shootings in just one year, highlighting the deadly results of American police policies that generally allow officers to use deadly force when they deem necessary.In both instances, according to an analysis by the Washington Post, Ceres police officer Ross Bays shot at individuals who had stumbled out of a car and began running away — and experts say that the timing of the shootings should be worrisome, even though both were ultimately ruled justified.",
        },
        {
            "Title": "McDonald’s Wins High-Stakes Labor Battle With Help From White House",
            "Date": "2019-12-12 17:19:49-05:00",
            "Link": "https://news.yahoo.com/high-stakes-labor-showdown-mcdonald-100004413.html",
            "Description": '(Bloomberg) -- In a television commercial that’s become part of the lore surrounding Donald Trump’s affinity for McDonald’s Corp., he embraced a purple, lumpy denizen of the fast-food chain’s “McDonaldland” and said, “Together, Grimace, we could own this town.”He was talking about New York, not Washington. Yet on Thursday, some 17 years after he appeared in that spot for the “Big ’N’ Tasty” sandwich, President Trump’s appointees delivered a high-stakes political victory for McDonald’s in one of the most important labor disputes in decades.The national board that referees union-organizing drives effectively absolved the company of liability for alleged labor-law violations in some of its franchisees’ restaurants, easing a major threat to the fast-food giant’s business structure. Trump’s appointees overrode an agency judge and rebuffed ethical concerns raised by labor advocates to approve a group of settlements in the matter on a 2-1 decision. The deal resolves allegations of wrongdoing without holding the corporation legally liable as “joint employer” with its franchisees.The victory, which eluded McDonald’s during Obama’s presidency, could help the fast-food giant close a bruising chapter in its history that imperiled its valuable brand as well as the franchise structure it’s built on.  In an emailed statement, McDonald\'s Corp. said it was “pleased” that the case had been concluded, and that the decision “allows our franchisees and their employees to move forward, and resolves all matters without any admission of wrongdoing.”Separately, top administration officials, including acting White House Chief of Staff Mick Mulvaney, are pushing to enact new, more lenient rules that would help insulate McDonald’s and similar chains from liability for the conduct of their franchisees. “President Trump has made deregulation a priority across the administration, which has helped unleash unprecedented economic and job growth,” White House spokesman Judd Deere said.There’s no sign that Trump has personally intervened in the NLRB’s McDonald’s case. Regardless, the case stands apart—both in terms of its history and its potential repercussions.During a messy, multi-year saga, the company became a focal point in the “Fight for $15” movement to increase pay and unionize fast-food workers, among others. As protests engulfed McDonald’s restaurants, a corporate team responded by organizing a central effort to help franchisees push back against the union, according to evidence submitted in the case. Workers eventually complained to the NLRB, alleging that the tactics franchisees used amounted to illegal retaliation for engaging in federally protected union activities. In 2014, the board’s general counsel found enough merit in the workers’ claims to issue formal complaints against a group of franchisees, complaints that also accused McDonald’s of acting as a “joint employer” with them. McDonald’s and the franchisees have denied any illegal retaliation or other unfair practices. McDonald’s has called the allegations baseless and argued that it can’t be legally held responsible for decisions of its franchisees, who run more than 90% of McDonald’s restaurants and set their own wages and hiring practices. Franchisees denied the allegations as well.  In the board’s ruling Thursday, two Trump appointees approved proposed settlements that provide back pay to McDonald\'s workers but do not hold McDonald\'s Corp. liable as a "joint employer." In their decision, the members wrote that the deal would "remedy every violation alleged" in the government’s complaints against McDonald\'s."Moreover, we conclude that further litigation would impose a substantial burden on the parties, without a significant probability of prevailing on the complaint’s joint-employer allegation," board members Marvin Kaplan and William Emanuel said in the ruling.Union advocates had lodged a formal petition with the board arguing that Emanuel needed to recuse from the case because he worked at a law firm that McDonald’s hired to counter the Fight for $15 organizing and protest efforts.Emanuel "has considered the motion and has determined, in consultation with the Board’s Designated Agency Ethics Official, not to recuse himself," according to the ruling, which noted that his firm had not been representing McDonald’s or franchisees in the NLRB case itself. Last month, Board Chairman John Ring — who also came from a law firm that has worked for McDonald’s — revamped ethics policies that might have made it harder for him or Emanuel to participate in the case. As it turned out, Ring was not part of the three-member panel that ruled on the McDonald’s decision.In a dissent, the NLRB\'s sole Democrat, Lauren McFerran, said the settlements were "unreasonable," and that with McDonald\'s joint-employer status unaddressed, "it is likely that similar issues will arise in the future."The decision represents a setback for the Service Employees International Union, which since 2012 has backed the “Fight for $15” protests. The SEIU’s president, Mary Kay Henry, pledged to appeal any adverse decision.“It’s going to take a lot more than a politically motivated decision on behalf of a Trump administration doing McDonald’s bidding to stop the workers of the Fight for $15,” Henry said in a statement.The board\'s vote also means that the corporation’s moves to help resist the protests and unionization effort have received, more or less, tacit acceptance from federal regulators. Those tactics, which were discussed by and, at times, coordinated by regional executives of the company, included gathering intelligence from a cashier who attended a union meeting as a mole, circulating names of suspected pro-union workers and coaching a franchisee on how to avoid hiring union sympathizers, according to excerpts from thousands of previously unreported documents and internal emails. The documents, which were provided to the NLRB by McDonald’s and several franchisees under a federal judge’s subpoena, reveal an inside look at how McDonald’s corporate staff members worked with franchisees on strategies to fight the union.McDonald’s didn’t respond to specific questions about several allegations, but said in a statement to Bloomberg News that the case is “incredibly complex” and that the “evidence is vast and complicated, and requires significant context to accurately and responsibly consider.” The company took issue with Bloomberg’s summary of that evidence, saying, “What you have highlighted are selective allegations and asserted them as facts, when there has been no judicial decision or review.” Last year, as she rejected a proposed settlement in the case, an administrative judge for the NLRB found that the case contained “copious evidence pertinent to McDonald\'s activities in order to provide resources and support for its franchisees throughout the country in response to the Fight for $15 campaign.” Specifically, Judge Lauren Esposito wrote that the case included “evidence that McDonald’s response to the Fight for $15 campaign was formulated and implemented from its corporate headquarters.” On Thursday, the board ordered her to accept the settlement.The joint-employer question at the heart of the NLRB case carries profound implications. In 2015, in a different case that didn’t involve McDonald’s, the NLRB issued a ruling that would make it easier to hold companies accountable for franchisees’ mistreatment of workers. By 2017, that issue was seen as so dire—not just for McDonald’s, but for franchise operations generally—that the then-chair of the International Franchise Association compared it to the 9/11 terror attacks. While fighting McDonald’s at the NLRB, the union has opened other fronts too, arguing the company should share any liability for a range of alleged transgressions inside franchised stores. Recently, dozens of workers have alleged sexual harassment in the chain’s restaurants in lawsuits or complaints filed with the federal Equal Employment Opportunity Commission. In August, McDonald’s announced an “operator-led, company-supported” training initiative for 850,000 workers across the country to help ensure “safe and respectful” workplaces.Last month, amid that latest rash of allegations, the company fired Chief Executive Stephen Easterbrook for engaging in a consensual relationship with an employee, a violation of company policy. During his almost five-year tenure atop McDonald’s, Easterbrook presided over a sharp rise in the company’s share price—despite a decline in annual revenue to about $21 billion from $25 billion. The revenue changes stem from a “refranchising” strategy to sell corporate-owned stores to independent owners that began in 2015, according to McDonald’s. Over the same period, annual profit margins surged to about 28% from 17%, a jump driven partly by new innovations such as all-day breakfast, touch-screen ordering kiosks and home delivery.But in time, overseeing the company’s reversal of fortune in Washington—and preserving the liability buffer between the corporate headquarters and the franchisees—may be viewed as Easterbrook’s most lasting impact. After being targeted by the Fight for $15 campaign for years, this March McDonald’s announced that it would no longer fund lobbying efforts to prevent minimum wage increases. The company said in a letter that it would continue talking to lawmakers about how any increases should work, including that “all industries should be treated the same way.” In its statement, the company said it has “made significant investments in our people practices to provide employees at both McDonald’s corporate-owned and franchise locations with opportunities for competitive wages, education and safe and respectful workplaces.”Average starting pay at its corporate-owned restaurants is $10 an hour, the company said—well above the federal minimum wage of $7.25 an hour but well below the fought-for $15. The average starting wage equates to $20,800 over a year’s worth of 40-hour weeks. “While franchisees control wages in their restaurants, we believe they are similar and competitive,” the company said.Most people remember Ray Kroc, who took McDonald’s from a small, California-based chain to a global fast-food empire, for innovations in franchising, but he also pioneered the low-wage fast-food job. As he oversaw the chain’s proliferation nationwide, the new restaurants staffed up with low-wage workers, many of them teenagers. Today, teens are a declining share of the food-service workforce; 18% of restaurant workers are aged 16 to 19, down from 20% in 2008, according to the National Restaurant Association, which projects additional declines by 2026. About 90 percent of McDonald’s 14,000 U.S. restaurants are franchises, a structure that keeps the company relatively asset-light and low-risk. The Trump administration is working on new rules that would reduce legal exposure for corporate franchisers. The proposals would make it harder, for example, to hold McDonald’s Corp. liable, along with franchisees, if kitchen managers are accused of sexual harassment or workers claim they weren’t paid overtime. The structure also makes it nearly impossible for workers at franchised restaurants to win the right to bargain collectively with McDonald’s executives—unless the NLRB determines that the corporation is indeed the workers’ “joint employer.” Without that, or a negotiated deal between the company and the union, any organizing effort would have to take place in pieces, franchise by franchise. The risk that the corporation could simply drop any unionized franchise would make that even harder to accomplish.Over the years, the company has weathered its share of public relations challenges. French anti-globalization radicals bombed its restaurants. Animal-rights extremists distributed “Unhappy Meals” with a plastic chicken covered in fake blood. The 2001 book Fast Food Nation tied McDonald’s to the obesity epidemic. But the Fight for $15 movement took place on a scale the company hadn’t seen before.Beginning in 2012, in the wake of the Occupy Wall Street demonstrations, a union-backed drive immersed McDonald’s restaurants in street protests that eventually spread globally. Protesters jammed drive-thrus, chanted in restaurants, banged on windows and stood atop tables. Corporate executives monitored developments as managers helped orchestrate a years-long anti-union response across the U.S., according to an analysis of thousands of pages of documents filed in the national labor board’s case. In 2014, the NLRB’s Obama-era general counsel alleged that the company’s subsidiary, McDonald’s USA LLC, was liable as a joint employer for a nationwide pattern of anti-union activity that included franchisees making threats, conducting surveillance, cutting work hours and firing workers who sought better pay and working conditions.Signs of unionizing efforts began emerging in October 2012, as reflected in a memo about organizing activity that circulated via McDonald’s internal email. “Seems to be affiliation with Occupy Wall Street movement,” said the document, which was in an email from a senior director of human resources. Soon, notes about the union showed up on an internal McDonald’s “activity log.” Said one entry: “White male talking to employees about affordable housing and asking questions about pay. Repeatedly in restaurant.”After word of an upcoming union meeting surfaced, a cashier at one New York City McDonald’s acted as a mole for the company, records show. She attended the meeting in Harlem, and by the next day, she shared her findings: About a dozen workers signed up to be union leaders, a report on the incident said.“They said McD makes $Billions + only pay minimum wage,” the worker reported. “… Focus seems to be on young, attractive female cashiers that speak English well ….”On Nov. 29, 2012, the Fight for $15 campaign made its first public splash with protests at fast-food restaurants across New York City as workers at McDonald’s and other chains went on strike for the day. From there, protests spread nationwide, fueled by old-school organizing and social-media messaging. At the time, McDonald’s had only a sparse social-media team and had yet to match the union in that capacity, according to two people familiar with the company’s operations.The company created fast, effective communications channels with franchisees to discuss the union’s activities. In emails and text messages, its managers made plans to combat “the opposition” and emphasized that some messages needed to be secret.“There is a sense of urgency regarding the gathering of this intel so that we can plan and prep the operators …,” said one email from a human resources director. “As a tip, you can text your operators regarding this message, however you have to instruct them to ERASE the message and response back to you, and you will need to do the same.” McDonald’s didn’t respond to questions about why recipients were advised to erase messages.In addition to a cadre of labor lawyers and several public relations firms, McDonald’s worked with “union avoidance” strategists, records show. In one case, a regional executive shared with a franchisee strategies on how to identify and avoid “salts,” or people who try to get hired in order to help organize a workplace. Federal law restricts the organized avoidance of such hires.Corporate employees circulated names of workers thought to be supporting the union. Once, in 2013, the company dispatched a “mobile security detail” to several Manhattan franchisees’ restaurants after receiving what an internal email described as “intel” about a possible Fight for $15 rally. The company told Bloomberg News that at times “security may be necessary on-site at restaurants for the safety of our property, customers and/or employees.”More than once, a regional McDonald’s executive organized gatherings in downtown Chicago for franchisees to discuss the situation, internal emails show. Their choice of venue? A Ronald McDonald House, part of the nonprofit foundation whose stated mission is to “improve the health and well-being of children and their families.”Since the unionization drive began, dozens of workers have filed complaints with the NLRB alleging elements of an anti-union culture in McDonald’s restaurants. Emmanuel Flores, 28, told Bloomberg he saw just such a culture firsthand at a company-owned restaurant in Monterey Park, California.Flores said he endured months of lewd comments, sexual overtures and groping from supervisors and co-workers. Early this year, on the advice of a union organizer, he told his store manager about it.The next day, Flores said, his shift hours were cut. Days later, during an informal staff meeting with him and other workers, the manager compared union activists to “leeches” and said “that even if we got paid $15 an hour, it wouldn’t matter because she would cut our hours,” Flores said. Flores filed complaints with California officials and the EEOC, and he was named as a witness in a retaliation complaint that the union filed with the NLRB. Trump’s fondness for McDonald’s is no secret. During his 2016 campaign, it was part of his standard fare; one order consisted of “two Big Macs, two Fillet-O-Fish, and a chocolate malted,’’ wrote his former campaign aides Corey Lewandowski and David Bossie in their 2017 book, Let Trump Be Trump.McDonald’s soon met with senior members of the new administration. In July 2017, Trump’s first labor secretary, Alexander Acosta, sat down for dinner at The Smith, a popular restaurant near Capitol Hill, with Easterbrook and Sam Tatevosyan, the company’s top lobbyist, according to the official Department of Labor calendar. The next day, Acosta and Treasury Secretary Steve Mnuchin spoke at a McDonald’s lobbying summit, records show. Acosta declined to comment, as did a spokesman for Mnuchin.McDonald’s said it hosts both Democrats and Republicans for such Washington meetings. “The company traditionally invites officials from the current administration to discuss topics relevant to the business—and did the same during the Obama administration,” the company said.  Once Trump’s appointees began taking office, McDonald’s sought to end its long struggle at the NLRB. In December 2017, a lawyer for the company emailed a letter to the board’s new general counsel, Peter Robb. Robb prosecuted a landmark case against the American air traffic controllers’ union during President Ronald Reagan’s administration. The union was found to have engaged in an illegal strike, and Reagan fired more than 11,000 workers, a lasting blow to the American labor movement.“Our request is straightforward,” said the McDonald’s letter, a copy of which was reviewed by Bloomberg News. “We ask that you use your prosecutorial discretion to end this waste of taxpayer resources and consider what your predecessor would not consider—a global resolution of the underlying unfair labor practice allegations.” The lawyer asked for a resolution that would not designate McDonald’s a “joint employer.”Within a few months, the company got what it asked for: Robb’s office offered to settle the case with no joint-employer finding. The proposed settlement would have provided back pay to about 20 workers, in amounts ranging from about $30 to $50,000, and it required no admission of any wrongdoing. But the administrative judge overseeing the case, Esposito, rejected the settlement, calling it too lenient on the company.The White House in effect aided McDonald’s in other ways. According to people who’ve worked in the administration, Acosta drew Mulvaney’s ire for dragging his feet on Labor Department rule changes, including making the agency’s “joint employer” standard more lenient. Colleagues thought Acosta was too concerned about provoking congressional Democrats, according to two people familiar with the situation. Trump’s aides repeatedly pressed Acosta’s staff during White House meetings about the status of the rules—and Mulvaney largely replaced Acosta in the process, taking final say over the new rules’ content and timing, the people said. Mulvaney tends to get more involved in policy than previous chiefs of staff because of his dual role as White House budget director, according to a White House official who spoke on background. When his Office of Management and Budget pushes back on an agency’s work, it’s for good reasons, the official said.At the NLRB, Trump appointees have attempted to defang the joint-employer threat, despite encountering ethical snags. The Board tried in 2017 to overturn an Obama-era precedent on the issue, but then had to quickly invalidate that change after the agency’s ethics officer found that one of Trump’s appointees, Emanuel, had wrongly failed to recuse himself. The board is now trying to change the standard using its rulemaking authority instead.Meanwhile, Robb has asked board members to overturn the judge’s rejection of his proposed McDonald’s settlement. Union advocates lodged a formal petition with the board, arguing that two of Trump’s appointees must recuse themselves from the case because they worked at law firms that McDonald’s hired to counter the Fight for $15 organizing and protest efforts.On Nov. 19, the board’s Trump-appointed chairman, John Ring, released what he called a “first of its kind” internal ethics review, which clears a path for the board to set aside such objections. Ring is one of the two board members who’ve been urged to recuse; while he came to the board from a law firm that worked for McDonald’s, there’s no evidence that he personally worked for the company.Ring’s unusual “ethics recusal report” last month concluded that each NLRB member can “insist on participating” in cases even if federal ethics officials say otherwise. While the ethics officials’ decisions may be binding, they’re not “self-enforcing,” the report found. So NLRB board members can overrule them simply by disagreeing with their legal conclusions, Ring wrote. He didn’t respond to a request for comment.The McDonald’s case has generated 21,000 pages of trial transcript, with testimony from more than 100 witnesses. Judge Esposito called it “the largest case ever adjudicated by this agency.” The union’s pledge to appeal Thursday’s decision suggests that it could go on for years to come.For now, at least, the company has friends in the White House. In April, Mulvaney spoke at McDonald’s latest lobbying event, where the joint-employer issue was a key topic. He wore a tie the color of the golden arches.—With assistance from Leslie Patton and Ben Penn.  (Updates throughout with labor board’s decision. An earlier version of this story was  updated with additional comment from McDonald’s on refranchising strategy)To contact the authors of this story: Lauren Etter in Los Angeles at letter1@bloomberg.netJosh Eidelson in Palo Alto at jeidelson@bloomberg.netHassan Kanu in Arlington at hkanu2@bloomberg.netMichael Smith in Miami at mssmith@bloomberg.netTo contact the editor responsible for this story: John Voskuhl at jvoskuhl@bloomberg.net, Flynn McRobertsFor more articles like this, please visit us at bloomberg.com©2019 Bloomberg L.P.',
        },
        {
            "Title": "The 7 candidates who qualified for the December debate",
            "Date": "2019-12-13 05:40:25-05:00",
            "Link": "https://news.yahoo.com/2020-candidates-qualified-december-debate-110255585.html",
            "Description": "The next 2020 debate takes place December 19 and with a smaller group.",
        },
        {
            "Title": "Turkey adds former Palestinian politician Dahlan to most wanted list",
            "Date": "2019-12-13 07:26:34-05:00",
            "Link": "https://news.yahoo.com/turkey-adds-former-palestinian-politician-122634855.html",
            "Description": 'Turkey has added exiled Palestinian politician Mohammed Dahlan to its "red list" of most-wanted terrorism suspects, offering a reward of up to 10 million lira ($1.75 million) for information leading to his capture, the Interior Ministry said on Friday. Arrest warrants have been issued for Dahlan on accusations of playing a role in the 2016 attempted coup in Turkey, seeking to change the constitutional order by force, and various spying-related charges, the ministry said in a statement. Dahlan has also recently been an outspoken critic of Turkish President Tayyip Erdogan.',
        },
        {
            "Title": "Does This Mean the End of the Mighty U.S. Marine Corps?",
            "Date": "2019-12-13 09:15:00-05:00",
            "Link": "https://news.yahoo.com/does-mean-end-mighty-u-141500349.html",
            "Description": "According to the new Commandant, “the Marine Corps is not organized, trained, equipped, or postured to meet the demands of the rapidly evolving future operating environment.”",
        },
        {
            "Title": "George P. Bush says GOP can't let 'racist' episodes slide",
            "Date": "2019-12-12 16:28:26-05:00",
            "Link": "https://news.yahoo.com/george-p-bush-says-gop-212826828.html",
            "Description": "Republican George P. Bush, the only member of the Bush dynasty still in public office, condemned Thursday recurring episodes of what he described as racist or hateful rhetoric within the Texas GOP, and ripped what he called false accusations fanned by his Hispanic heritage. Bush, Texas' land commissioner, first denounced a white GOP state legislator who suggested “Asian\" challengers on the ballot in 2020 were motivated by race.",
        },
        {
            "Title": "The Tiny, Simple Nuclear Reactor That Could Change Energy",
            "Date": "2019-12-13 17:51:00-05:00",
            "Link": "https://news.yahoo.com/tiny-simple-nuclear-reactor-could-225100257.html",
            "Description": "The next step in nuclear power is 1/100th the size of today's reactors.",
        },
        {
            "Title": "Ring Recommends Users Update Their Home Security System Passwords After String of Hacking Incidents",
            "Date": "2019-12-12 20:17:12-05:00",
            "Link": "https://news.yahoo.com/ring-recommends-users-home-security-011712460.html",
            "Description": "Hackers were able to gain control — and in some cases, speak through — Ring security cameras",
        },
        {
            "Title": "The US and NATO are preparing for Russia to go after troops in the field and at home",
            "Date": "2019-12-13 10:43:12-05:00",
            "Link": "https://news.yahoo.com/us-nato-preparing-russia-troops-154312954.html",
            "Description": "NATO is designed for air, land, sea, space, and cyberspace operations, but on the fringes of those, hybrid activity poses a new kind of challenge.",
        },
        {
            "Title": "Spokane Cop Accused of Sex Assault Finally Loses Pay After More Accusers Come Forward",
            "Date": "2019-12-13 13:32:53-05:00",
            "Link": "https://news.yahoo.com/spokane-cop-accused-sex-assault-183253901.html",
            "Description": "A Washington state police officer once told a coworker he would “say exactly what's on my mind, unless I'm on body camera.” This week, his boast came back to haunt him. The Spokane Police Department suspended Officer Nathan Nash without pay after a domestic violence victim accused him of assaulting her, and a police investigation found he had turned off his body camera during the event.The investigation began in October, when a domestic violence victim told the police department Nash had sexually assaulted her in a follow-up call to her house. The woman says she called Nash to ask about the location of her evidence photos, according to court documents obtained by KXLY. Nash allegedly asked her to meet in a private place to “go over the bruises on her body” and then pressed her to let him come over before her mother returned. On his way to the woman’s apartment, Nash allegedly turned off both his body camera and tracking equipment, resulting in a 36-minute location gap that a police analyst later described as “peculiar.” Once inside, the woman says, Nash followed her into her bedroom and directed her to take off her pants and underwear. She told investigators she was confused by the request, but complied because he was a police officer. The woman says Nash then penetrated her with his fingers for 30 seconds to a minute. She says she panicked, but thought it might be what he was supposed to do. Eventually, she says she told Nash \"OK, that's enough.\" She later told investigators the alleged assault was the worst thing that has ever happened\" to her.Before leaving, the woman says, he gave her his personal cellphone number. He did not photograph or otherwise document her bruises.When questioned by investigators, Nash blamed the incident on the domestic violence victim, suggesting that she had come on to him and become “embarrassed, mad, or upset,” when he ended the sexual contact, according to court documents. He added that the police department's body camera manual was more than 100 pages and “there's no way I'm gonna know all that content.\" In a statement after Nash's arrest, his personal attorney Rocco Treppiedi said Nash “categorically denies the allegation of sexual assault and any criminal activity.” “Ofc. Nash considered the additional evidence she provided, and immediately followed up on the information she provided,” Treppiedi said. Nash’s attorneys did not respond to The Daily Beast’s request for comment.In the weeks after the initial report, two more women came forward with concerns about Nash. One was a second domestic violence victim, who told investigators that Nash had come on to her while he was investigating her complaint in May. During a visit to her home, the woman said, Nash made a point of turning off his bodycam, then gave her his personal cellphone number and said he would respond faster than 911. Over the following weeks, she says he friended her on Facebook and started liking photos of her in lingerie, and sending her “creepy” and “needy” messages. According to court documents, she told investigators she felt he “had a hidden agenda of starting a relationship with her.”A police department volunteer also complained about Nash, claiming he had given her his personal number and sent her inappropriate texts, including a Jeopardy-themed message reading, “Things I would like to do to you for $600,” and “Answer: what is a naked back rub?”“I’m too old to play games, no need in beating around the bush,” Nash allegedly wrote in another message. “I just say exactly what’s on my mind, unless I’m on body camera.\"Nash was arrested on Nov. 22 and pleaded not guilty to second- and third-degree rape and official misconduct. His trial is set to begin in February.Nash was originally placed on administrative leave while the investigation progressed. This week, the police department put him on “unpaid lay-off status,” meaning he will not work or be paid until the outcome of his case is determined.  If he is found not guilty, he will be reinstated while the department investigates whether he violated any department policy, City spokesperson Marlene Feist told local news station KREM.“The alleged conduct is completely unacceptable and in absolute conflict with the high standards of the Spokane Police Department,” Chief Craig Meidl said in a press release. “Our men and women took an oath to protect and serve the community in which we live. We will not shy away from that oath and it will be upheld.”Read more at The Daily Beast.Get our top stories in your inbox every day. Sign up now!Daily Beast Membership: Beast Inside goes deeper on the stories that matter to you. Learn more.",
        },
        {
            "Title": "Trump news: House panel votes to advance impeachment articles as president announces US-China trade deal",
            "Date": "2019-12-13 02:19:00-05:00",
            "Link": "https://news.yahoo.com/trump-news-live-congress-move-093621811.html",
            "Description": "The House Judiciary Committee voted along party lines to support articles of impeachment against Donald Trump on Friday after an abrupt end to Thursday’s 12-hour marathon debate over their merits, a session characterised by Republican stalling and heated protestations.Following the votes, the president announced a trade deal between the US and China will begin lifting tariffs on Chinese goods by 15 December — a deal he previously said wasn't likely until after the next election.",
        },
        {
            "Title": "Ocasio-Cortez condemns 'white supremacist sympathizer' Tucker Carlson",
            "Date": "2019-12-12 11:04:21-05:00",
            "Link": "https://news.yahoo.com/ocasio-cortez-condemns-white-supremacist-160421241.html",
            "Description": "Top Democrat says host’s Fox News show an ‘hour-long production of unmitigated racism’ after racist and xenophobic debateDemocratic congresswoman Alexandria Ocasio-Cortez has condemned Fox News and Tucker Carlson, calling the TV host a “white supremacist sympathizer” and saying his show represents an “hour-long production of unmitigated racism”.The comments came following a segment on Carlson’s show in which he and his guest, City Journal editor Seth Barron, commented on footage of an unremarkable amount of trash on the streets of Ocasio-Cortez’s New York City district and blamed it on immigrants, whom Barron said had “occupied” the district and made it “one of the least American districts in the country”.Carlson asked: “How can we take seriously anything she says about the environment when this is her congressional district? She should be ashamed of this.”Using racist and xenophobic tropes, Barron responded that “her district is actually one of the least American districts in the country, and by that, I don’t mean that it’s not part of America, but it’s occupied by relatively few American citizens.”He went on: “The way they inhabit housing there is such that they live in a lot of illegal spaces like basements, and many people live there, so they wind up producing a lot of garbage that the landlords don’t want thrown out normally. Hence, you wind up with a lot of garbage on the streets. You have illegal food vendors pouring their pig grease in the gutters.”It was unclear where he was getting this information from.Carlson and his guests, much like the president, frequently imply that immigrants are making the country “poorer and dirtier”.Carlson has called the idea of white supremacy in America a hoax.On Wednesday night on Twitter, Ocasio-Cortez shared video of the segment and wrote: “I go back and forth on whether to go on Fox News.”She said: “The main reason I haven’t is squaring the fact that the ad revenue from it bankrolls a white supremacist sympathizer to broadcast an hour-long production of unmitigated racism, without any accountability whatsoever.”She added: “‘Immigrants are dirty’ is a lazy, tired, racist trope.”Barron later apologized on Twitter, saying he had not done “justice to a complicated issue” of crowded housing conditions.",
        },
        {
            "Title": "Washington state seeks to ban sale of 'assault weapons,' high capacity magazines",
            "Date": "2019-12-12 19:46:12-05:00",
            "Link": "https://news.yahoo.com/washington-state-seeks-ban-sale-004612577.html",
            "Description": 'If successful, Washington would become the seventh U.S. state to ban assault weapons, which it defines as semi-automatic rifles with at least one military feature, and the ninth to limit the capacity of ammunition magazines. "We should be making it harder for those who want to inflict mass violence and destruction upon innocent people," Governor Jay Inslee said in announcing the gun-control push.',
        },
        {
            "Title": "Meet The J-10 Fighter: China's Very Own F-16 That Is Now For Sale",
            "Date": "2019-12-12 13:00:00-05:00",
            "Link": "https://news.yahoo.com/meet-j-10-fighter-chinas-180000982.html",
            "Description": "It's a bit behind the curve in terms of what modern air forces are flying.",
        },
        {
            "Title": "Catholic dioceses spar over Archbishop Sheen sainthood",
            "Date": "2019-12-12 15:34:32-05:00",
            "Link": "https://news.yahoo.com/catholic-dioceses-spar-over-archbishop-203432489.html",
            "Description": "In an unusual public spat, the Roman Catholic diocese of Peoria, Illinois, is accusing the Rochester, New York, diocese of trying to “sabotage” the beatification of Archbishop Fulton Sheen. Sheen, who before his death in 1979 was famous for his radio and TV preaching, had been scheduled to be beatified — the last step before sainthood — in a ceremony in Peoria on Dec. 21.",
        },
        {
            "Title": "Heavy, gusty storms to rattle Florida, Georgia into Friday night",
            "Date": "2019-12-13 12:21:42-05:00",
            "Link": "https://news.yahoo.com/heavy-gusty-storms-rattle-florida-172142672.html",
            "Description": "While an outbreak of severe weather is not anticipated, storms capable of producing strong gusts and flash flooding will pester parts of the southeastern United States into Friday night.The thunderstorms are part of a large and strengthening storm that is producing an expanding swath of heavy rain in the eastern third of the nation. The risk is greatest from the central part of the Florida Peninsula to southeastern Georgia and the immediate coast of South Carolina. The risk also extends westward over part of the Florida Panhandle as well.People in this area should keep an eye on the weather. Heavy, gusty thunderstorms can briefly become severe with high winds, small hail and perhaps an isolated tornado. A satellite image showing precipitation over the southeastern U.S. on Friday, December 13, 2019, around midday. (AccuWeather) What adds to the threat is the likelihood of storms developing after dark Friday.By Saturday, dry air is forecast to sweep from west to east across the region and end the thunderstorm threat.Download the free AccuWeather app to check the forecast in your area. Keep checking back on AccuWeather.com and stay tuned to the AccuWeather Network on DirecTV, Frontier and Verizon Fios.",
        },
        {
            "Title": "Russia said it was alarmed after the U.S. tested a ground-launched ballistic missile",
            "Date": "2019-12-13 10:16:02-05:00",
            "Link": "https://news.yahoo.com/russia-said-alarmed-u-tested-151602033.html",
            "Description": "Russia said on Friday it was alarmed after the United States tested a ground-launched ballistic missile that would have been banned under the Intermediate-Range Nuclear Forces Treaty, the RIA news agency reported.",
        },
        {
            "Title": "29 photos show how climate change has ravaged the Arctic in the past decade",
            "Date": "2019-12-13 15:14:00-05:00",
            "Link": "https://news.yahoo.com/29-photos-show-climate-change-201400218.html",
            "Description": "NOAA's Arctic Report Card warns that climate change is transforming the Arctic. These photos show its dire effects on the region so far this decade.",
        },
        {
            "Title": "Bulletproof vest did not fail in fatal shooting of Houston police officer, chief says",
            "Date": "2019-12-12 15:16:45-05:00",
            "Link": "https://news.yahoo.com/bulletproof-vest-did-not-fail-201645655.html",
            "Description": "Houston Police Chief Art Acevedo says body armor didn't fail Sgt. Christopher Brewster, who was killed while responding to a domestic violence call",
        },
        {
            "Title": "Why the Next North Korea Crisis May Bring Less Fire, Less Fury",
            "Date": "2019-12-13 16:00:00-05:00",
            "Link": "https://news.yahoo.com/why-next-north-korea-crisis-210000945.html",
            "Description": "(Bloomberg) -- U.S. President Donald Trump is trading insults with Kim Jong-un, North Korea is launching missiles and no one’s talking about disarmament. It’s beginning to feel like the days of “fire and fury” are here again.Or maybe not. While Kim’s nuclear arsenal is believed to have only grown more dangerous in the two years since Trump last threatened to “totally destroy” the country, the geopolitical landscape has shifted in ways that may make the brinkmanship of 2017 less attractive to both men.For starters, a series of dovish moves by Trump -- including canceling a strike on Iran and withdrawing troops from Syria -- have undercut his threats of military action. Kim, meanwhile, must be careful he’s not so provocative that he prompts more sanctions or loses the diplomatic profile he gained during his unprecedented detente with Trump.So, despite Kim’s warning he’ll take a “new path” if Trump doesn’t make a better offer in nuclear talks by the end of the year, he faces largely the same dilemma he has for most of 2019. How can he raise enough pressure on Trump to force a concession, without becoming an international pariah again?“It’s neither in the U.S.’s nor North Korea’s interests to cross each other’s red line,” said Kim Hyun-wook, a professor at the Korea National Diplomatic Academy. “Trump would have to take measures that aren’t necessarily politically beneficial for him, and North Korea knows that it won’t be able to tolerate the response measures either.”For more than two years, North Korea has refrained from testing nuclear bombs or missiles capable of carrying them to the U.S. mainland -- something Trump touts as a key first-term achievement. The region has been bracing for an end to that lull since the president walked away from his second face-to-face meeting with Kim in February and North Korea kicked off what became a record year of shorter-range rocket tests.In recent days, the rhetoric has turned personal again, with Trump reviving his “Rocket Man” nickname for Kim and a top North Korean official dismissing the U.S. president as a “heedless and erratic old man.” North Korea has said it was preparing a choice of “Christmas” gifts for Trump, with Kim expected to announce his judgment at an upcoming meeting of the Workers’ Party in Pyongyang.Kelly Craft, the U.S.’s ambassador to the United Nations, told the Security Council on Wednesday that she saw “deeply troubling indications” that North Korea was poised for a major provocation, including an ICBM test or space launch. Trump’s top envoy for nuclear talks, Stephen Biegun, is expected to arrive Sunday in Seoul for what will likely be the U.S.’s last chance to dial back tensions before the new year.Trump has so far played down North Korea’s warnings, saying in a tweet that Kim was “too smart and has far too much to lose” to renew hostility with the U.S. A serious provocation would put more strain on the Republican leader during an election year, as Democrats seek to portray him as destabilizing to global security and too accommodating of autocrats like Kim.Still, North Korea has more rungs to climb before conducting its seventh nuclear test or launching its first ICBM since November 2017. First, Kim could simply announce that he was rescinding his moratorium on such tests -- an intermediate step North Korea has taken before scrapping previous freezes.“They will up the ante, but will calibrate it just enough so that the talks won’t totally break down,” said Yasuyo Sakata, a professor at Kanda University of International Studies. “The red line is that they cannot do a real intercontinental ballistic-missile test. But they can do satellite tests, for example.”North Korea may have also signaled lesser potential provocations, including by conducting a Dec. 7 engine test at the Sohae Satellite Launching Ground. South Korea sees a possibility of North Korea launching a satellite on a ballistic-missile class projectile before Christmas, the JoongAng Ilbo newspaper said this week, citing an unidentified government source.Kim could also fire an intermediate-range missile over U.S. ally Japan, something he last did in September 2017. Earlier this month, a North Korean diplomat released a statement warning that Prime Minister Shinzo Abe may see a ballistic missile “in the not distant future and under his nose.”North Korea must take care not to alienate Chinese President Xi Jinping and Russia’s Vladimir Putin, who both wield Security Council vetoes and advocate sanctions relief for it. Xi in particular doesn’t want trouble that may blow back across China’s border with North Korea, including the threat of a regional war with the U.S. or American sanctions against Chinese banks.“No matter what we do, it should be conducive to reducing tension, to promoting dialogue, and thus prevent from falling back into confrontation,” Zhang Jun, China’s ambassador to the UN, told reporters after the Security Council meeting last week.There are some advantages for Kim in raising the heat on Trump through 2020, including demonstrating weapons technology that will better deter any U.S. invasion and establish North Korea as a nuclear state. He has likely found enough ways around international sanctions to keep his economy stable for the time being, UN observers have said.In the long run though, Kim probably needs to get out from under the sanctions if he wants to develop the industrial and tourism projects he promotes almost daily in state media. And he’s unlikely to find a better U.S. negotiating partner than Trump, who has defied convention by meeting him and showering him with praise.“It is possible that North Korea wants to regroup while the U.S. presidential election plays out,” said Naoko Aoki, an adjunct political scientist at RAND Corp. “That may mean increasing and improving its nuclear and missile arsenal, and then negotiating from what it may consider a position of increased leverage.”To contact the reporters on this story: Isabel Reynolds in Tokyo at ireynolds1@bloomberg.net;Jihye Lee in Seoul at jlee2352@bloomberg.netTo contact the editors responsible for this story: Brendan Scott at bscott66@bloomberg.net, Shamim AdamFor more articles like this, please visit us at bloomberg.com©2019 Bloomberg L.P.",
        },
        {
            "Title": "Man dresses as mother to take driving test after she failed three times",
            "Date": "2019-12-13 06:23:27-05:00",
            "Link": "https://news.yahoo.com/man-dresses-mother-driving-test-112327585.html",
            "Description": "A man has been arrested for attempting to take a driving test on his mother’s behalf – by dressing like her in a bold attempt to fool examiners.Heitor Márcio Schiave, 43, wore a stuffed bra, floral top, long skirt, earrings, and a handbag to impersonate his mother at the State Department of Traffic in Novo Mutum Parana, in the Brazilian Amazon.",
        },
        {
            "Title": "The dream is dead: Johnson election triumph breaks UK 'remainer' hearts",
            "Date": "2019-12-12 22:53:29-05:00",
            "Link": "https://news.yahoo.com/dream-dead-johnson-election-triumph-035329859.html",
            "Description": "After all the arguments and all the mass marches, opponents of Brexit faced a stark truth on Friday after Prime Minister Boris Johnson's election landslide: there will be no second referendum and divorce from Europe is inevitable. With the Conservatives set to win their largest parliamentary majority since 1987, Johnson will be able to push his divorce deal through parliament, allowing Britain to leave the EU next month. It will be Britain's most significant geopolitical move since World War Two.",
        },
        {
            "Title": "F-35: Would You Spend $1,500,000,000,000 On a Plane That Can't Fly?",
            "Date": "2019-12-12 13:26:00-05:00",
            "Link": "https://news.yahoo.com/f-35-spend-1-500-182600680.html",
            "Description": "That's what the U.S. government did on the F-35.",
        },
        {
            "Title": "Parents of girl who fell to her death sue cruise company",
            "Date": "2019-12-12 19:53:54-05:00",
            "Link": "https://news.yahoo.com/parents-girl-fell-her-death-173512426.html",
            "Description": "The Indiana parents of a toddler who fell to her death out of an open cruise ship window in Puerto Rico filed a lawsuit Wednesday against Royal Caribbean Cruises, accusing the company of negligence by allowing the window to be opened. Chloe Wiegand fell to her death in July after her grandfather lifted her to the window on Royal Caribbean’s Freedom of the Seas ship while the vessel docked. “We should be celebrating with presents and a birthday cake, but instead we are talking about her death,” Chloe's mother, Kim Wiegand of Granger, Indiana, told reporters at a news conference in nearby South Bend.",
        },
    ],
]
